Repository: DzonnyDZ/Tools
Catalog: Projects/Metanol2/My Project/Resources.*.resx
Languages: cs

# Save_cmd
source: Save
cs: Uložit

source: Saving changed images
cs: Ukládám změněné obrázky

source: Error while saving {0}:
cs: Chyba při ukládání {0}:

# LargeFloating_n
source: Floating preview
cs: Plovoucí náhled

# LargeFloating_d
source: Does preview window float over main window?
cs: Je okno s náhledem plovoucí vůči hlavnímu oknu?

# ThumbSize_n
source: Thumbnail size
cs: Velikost miniatury

# UnsavedChanges
source: Current folder contains unsaved chages. Do you want to save them now? If you select not to save, changes will be lost!
cs: Aktuální složka obsahuje neuložené změny. Chcete je nyní uložit? Pokud zvolíte ne, změny budou ztraceny!

source: Error
cs: Chyba

# catDisplay
source: Display
cs: Zobrazení

# KeywordsAreNotSupportedByCommponProperty_internalError
source: Keywords are not supported by the Common property
cs: Klíčová slova nejsou podporována vlastností Common

source: Unknown splitter
cs: Neznámý oddělovač

source: Error while loading {0}:
cs: Chyba při načítání {0}:

# SaveChanges_dlgTitle
source: Save changes
cs: Uložit změny

# ThumbSize_d
source: Size of image preview in main window
cs: Velikost náhledu obrázku v hlavním okně

# SomeChangedSomeNot
source: Warning: Some values were changed. Same value weren't changed
cs: Varování: Některé hodnoty byly změněny zatímco jiné nikoliv.

# DontSave_cmd
source: Don't save
cs: Neukládat

source: Preview
cs: Náhled

# TCBehavior_d
source: List of images behaves like that one in Total Commander
cs: Seznam obrázků sechová jako v Total Commanderu

# catBehavior
source: Behavior
cs: Chování

# WhyIsNotMergePossible
source: In order to perform keywords merging you must select at least 3 images and make the target one of them active.
cs: Ke sloučení klíčových slov musíte vybrat alespoň 3 obrázky a cílový označit jako aktivní.

# TCBehavior_n
source: TC Behavior
cs: TC chování

# CannotDrawItemWithoutListView
source: Cannot draw item without ListView set
cs: Nemohu vykreslit položku, která nemá nastaven ListView

source: Synchronize With Database
cs: Synchronizovat s databází

source: File successfully created.
cs: Soubor vytvořen úspěšně.

source: Create newdatabase file
cs: Vytvořit nový databázový soubor.

source: Test connection failed
cs: Test spojení selhal.

source: Folder {0} does not exists.
cs: Složka {0} neexistuje.

source: Bad folder
cs: Špatná složka

source: Child folder {0} of {1} is already selected.
cs: Dětská složka {0} v {1} již je vybrána.

source: Parent folder {0} of {1} is already selected.
cs: Rodičovská složka {0} {1} již je vybrána.

source: Path {0} is already selected.
cs: Cesta {0} již je vybrána.

source: Counting
cs: Počítám

source: please wait ...
cs: prosím čekejte ...

source: There was an error processing folder {0}:{1}{2}
cs: Došlo k chybě při zpracovávání složky {0}:{1}{2}

source: Ignore all
cs: Ignorovat vše

source: Image in database
cs: Obrázky v databaázy

source: Do not show this dialog again.
cs: Příště tento dialog nezobrazovat.

# TheFileWithSameNameAs0AlreadyExistsInDatabaseInThe1
source: The file with same name as {0} already exists in database in the {1} folder.
cs: Soubor se stejným názvem jako {0} již existuje v databáze ve složce {1}.

source: Relocate
cs: Přesunout

source: Test succeeded.
cs: Test úspěšný.

source: Test connection
cs: Otestovat spojení

# IgnoreLenghtConstraints_d
source: Allow to save longer string values than allowed by IPTC standard
cs: Povolit ukládat řetězce delší než dovoluje IPTC standard

# IgnoreLenghtConstraints_n
source: Ignore lenght constraints
cs: Ignorovat omezení délky

# IptcUtf8_d
source: Save IPTC data in UTF-8 encoding
cs: Ukládat IPTC data v kódování UTF-8
