Repository: DzonnyDZ/Tools
Catalog: Tools Win/Resources/ExceptionsWin.*.resx
Languages: cs

source: Cannot create link from file {0}.
cs: Nemohu vytvořit zástupce ze souboru {0}.

source: Hotkey must include a modifier key.
cs: Horká klávesa musí obsahovat modifikátor.

source: Unable to obtain handle to system menu.
cs: Nemohu získaz handle systémového menu.

# IsInvalidKeyKeysMustBeWithinRangeFrom0To255
source: {0} is invalid key. Keys must be within range from 0 to 255.
cs: {0} je neplatný klíč. Klíč musí být z rozsahu do 0 do 255.

source: Hook is already registered for this instance.
cs: Hák již byl pro tuto instanci registrován.

source: Hook is not registered for this instance
cs: Hák nbyl pro tt instanci registrován

source: Unknown raw input device type {0}
cs: Neznámý typ nzkoúrovňového zařízení {0}

source: Raw device name has unexpected format. It must start with "{0}".
cs: Název nízkoúrovňového zařízení má neočekávaný formát. Musí začínat "{0}".

# RawDeviceNameHasInvalidFormatItShouldConsistOf4Parte
source: Raw device name has invalid format. It should consist of 4 parte separated by #.
cs: Název nízkoúrovňového zařízení má neplatný formát. Měl by obsahovat 4 části oddělené #.

# TheCalassGuidPartOfDeviceNameIsInInvalidFormatSeeInnerException
source: The calass guid part of device name is in invalid format. See InnerException for details.
cs: ˇčást jména zařízení reprezentující guid třídy má neplatný formát. Vizte InnerException pro podrobnosti.

source: Source of window message evnt must be same as owner ow this instance
cs: Zdroj události okenní zprávy musí být stejný jako majitel této instance

# MessageTargetWindowHandleMustBeSameAsHandleOfWindow
source: Message target window handle must be same as handle of window this instance was created for
cs: Handle cílového okna zprávy musí být stejný jako handle, pronějž byla tato instance vytvořena

source: Given owner has already attached RawInputEventProvider
cs: Zadaný majitel již má připojen RawInputEventProvider

# WhenOnlyOneDeviceIsBeingUnRegisteredItCannotHaveExclude
source: When only one device is being (un)registered, it cannot have Exclude set to true.
cs: Pokud je jen jedno zařízení (od)regsitrováváno, nemůže mít nastaveno Exclude na true.

# DevicesCanBeExcludedOnlyFromUsagePagesBeingRegistered
source: Devices can be excluded only from usage pages being registered in same batch.
cs: Zařízení mohou být vyňata jen ze stránek užití regitrovaných ve stejné dávce.

source: Device with Exclude set to true must have Usage set to zero.
cs: Zařízení s Exclude nastaveným na true musí mít Usage nastaveno na 0.

# LegacyMessagesCanBeDisabledOnlyForKeyboardAndMouseDevice
source: Legacy messages can be disabled only for keyboard and mouse device, or when whole generic desktop controls usage page is being registered.
cs: Původní zprávy mohou být zakázány jen pro zařízení myši a klávesnice, nebo když je celá stránka užití obecných desktopových ovladačů registrována.

# CannotConvertRAWINPUTMarshallingToRAWINPUTNonMarshalling
source: Cannot convert RAWINPUT_Marshalling to RAWINPUT_NonMarshalling when it contains HID data
cs: Nelze konvertovat RAWINPUT_Marshalling to RAWINPUT_NonMarshalling, když obsahuje HID data

source: Additional events have been already called.
cs: Doplňující události již byly zavolány.

# LenghtOfOriginalRawItemsCountMustBe1AndOriginalRawItemSize
source: Lenght of Original.RawItemsCount must be 1 and Original.RawItemSize must be 2 or 3.
cs: Délka Original.RawItemsCOunt musí být 1 a délka Original.RawItemSize 2 nebo 3.
