Repository: DzonnyDZ/Tools
Catalog: Tools/Windows/Forms/Composite controls/KeyWordsEditor.*.resx
Languages: cs

# cmdThesaurus.ToolTip
source: Thesaurus
cs: Tezaurus

# cmdMerge.ToolTip
source: Merge enabled for multiple items
cs: Pro více položek je aktivní režim slučování

# cmdAdd.ToolTip
source: Add word (Enter)
cs: Přidat slovo (Enter)

# tmiLabel.Text
source: Thesaurus menu
cs: Menu tezauru

# tmiAddSelected.Text
source: Add selected keywords
cs: Přidat vybraná klíčová slova

# tmiRemoveSelected.Text
source: Remove selected keywords
cs: Odebrat vybraná klíčová slova

# tmiClearCache.Text
source: &Clear cache
cs: &Vyčistit mezipaměť

# tmiManage.Text
source: &Manage...
cs: &Spravovat...

# tmiSynonyms.Text
source: &Synonyms
cs: &Synonyma

# tmiSynonyms.ToolTipText
source: Adds new group of synonyms with all selected words as keys
cs: Přidá novou skupinu synonym se všemi vybranými slovy jako klíči
