Repository: DzonnyDZ/Tools
Catalog: Tools/Resources/resx (Friend)/CLSComplianceCheckerResources.*.resx
Languages: cs

# e_TypeInAssembly
source: Error while getting types in assembly. Some types weren't loaded.
cs: Chyba při získávání typů v sestavení. Některý typy nebyly načteny.

# e_ModulesInAssembly
source: Error while getting modules in assembly
cs: Chyba při získávání modulů v sestavení.

# e_AttributeUsageAttribute
source: Cannot get AttributeUsageAttribute
cs: Nemohu získat atribut AttributeUsageAttribute.

# AttributeUsage_AllowMultiple
source: AttributeUsage.AllowMultiple violated, attribute {0} is used more than once.
cs: Porušení AttributeUSage.AllowMultiple, atribute {0} je použit vícekrát.

# AttributeUsage_ValidOn
source: AttributeUsage.ValidOn violated, attribute {0} cannot be applied to item of type {1}.
cs: Porušení AttributeUsage.ValidOn, atribut {0} nemůže být aplikován na položku typu {1}.

# e_TypesInModule_some
source: Error while getting types in module. Some types weren't loaded.
cs: Chyba při získávání typů v modulu. Některé typy nebyly načteny.

# e_TypesInModule
source: Error while getting types in module.
cs: CHyba při získávání typů v modulu.

# e_MethodsInModule
source: Error while getting methods in module.
cs: Chyba při získávání metod v modulu.

# GlobalMethods
source: Global methods are not CLS-compliant
cs: Globální metody nejsou CLS-kompatibilní.

# e_FieldsInModule
source: Error while getting fields in module.
cs: Chyba při získávání proměnných v modulu.

# GlobalFields
source: Global fields are not CLS-compliant
cs: Globální proměnné nejsou CLS-kompatibilní.

# InheritCLSCompliant
source: CLS-compliant type shall inherit only CLS-compliant type.
cs: CLS-kompatibilní typ může dědit jen od CLS-kompatibilního typu.

# NestedGenericTypeParametersCount
source: Type nested in generic type shall have at least as many type parameters as declaring type.
cs: Typ vnořený do generického typu musí mít nejméně tolik typových parametrů jako typ, do něhož je vnořen.

# NameOfGenericType
source: Name of generic type shall encode number of type parameters.
cs: Název generického typu musí obsahovat určení počtu generických parametrů.

# NameOfNestedGenericType
source: Name of nested type shall encode number of type parameters newly introdued by nested type.
cs: Název vnořeného typu musí obsahovat počet typových parametrů přidaných vnořeným typem oproti typu, ve kterém je vnořen.

# NestedGenericConstraint
source: When type parameter specifies a constraint, corresponding parameter of nested type shall specify it as well. Parameter {0} of type {1} is missing constraint to type {2}.
cs: Pokud typový parametr specifikuje omezení, odpovídající parametr vnořeného typu jej musí specifikovat také. Parametr {0} typu {1} postrádá ometení na typ {2}.

# NestedGenericConstraint_New
source: When type parameter specifies default constructor constraint, corresponding type parameters of nested type must specify it as well.
cs: Pokud typový parametr specifikuje omezení výchozí konstruktor, odpovídající parametr vnořeného typu jej musí specifikovat také.

# NestedGenericConstraint_Struct
source: When type parameter specifies value type (not nullable) constraint, corresponding type parameters of nested type must specify it as well.
cs: Pokud typový parametr specifikuje omezení hodnotový typ (nenullovatelný), odpovídající parametr vnořeného typu jej musí specifikovat také.

# NestedGenericConstraint_Class
source: When type parameter specifies reference type constraint, corresponding type parameters of nested type must specify it as well.
cs: Pokud typový parametr specifikuje omezení referenční typ, odpovídající parametr vnořeného typu jej musí specifikovat také.

# e_MembersInType
source: Error while geting members of type.
cs: Chyba při získávání členů typu.

# UniqueSignature
source: Member signature is not unique.
cs: Signatura člena není unikátní.

# EnumerationOnlyFields
source: Enumeration can contain only fields.
cs: Výčet smí obsahovat je proměnné.

# EnumerationFieldKind
source: Enum fields must be either static literals or instance field named "value__" marked RTSpecialName.
cs: Proměnné ve výčtu musí být buďto statické literály nebo instanční proměnná s názvem "value__" označená RTSpecialName.

# EnumerationValue__Type
source: Type of enumeration field value__ must be ebumeration underlying type.
cs: Typ proměnné výčtu value__ musí být typu, na němž je výčet postaven.

# EnumerationLiteralStatic
source: Enum member literals must be static.
cs: Členské literály výčtu musí být statické.

# TypeOfEnumMember
source: Enum member literals must be of same type as is enum itself.
cs: Členské literály výčtu musí být stejného typu jako výčet.

# InterfaceCLSIncompliantMember
source: Inerface shall not require CLS-incompliant members to be implemented in order to implement it.
cs: Rozhraní nesmí vyžadovat implementaci CLS-nekompatibilních členů ke své implementaci.

# InterfaceStaticMethod
source: Interface shall not declare static methods.
cs: Rozhraní nesmí deklarovat statické metody.

# InterfaceField
source: Interface shall not declare fields.
cs: Rozhraní nesmí deklarovat proměnné.

# RequireImplementIncompliant
source: CLS-compliant types shall not require implementation of CLS-incompliant members.
cs: CLS-kompatibilní typ nesmí vyžadovat implementaci CLS-nekompatibilních členů.

# MissingValue__
source: Enumeration is missing the value__ field.
cs: Výčet postrádá proměnnou value__.

# EnumType
source: Enum underlying type is not built-in CLS-comliant integral type
cs: Výčet není postaven na vestavěném CLS-kompatibilním celočíselném typu.

# CLSCompliantInCLSIncompliant
source: Member of CLS-incompliant type is marked as CLS-compliant
cs: Člem CLS-nekompatibilního typu označen jako CLS-kompatibilní.

# PropertyType
source: Property type is not CLS-compliant.
cs: Typ vlastnosti není CLS-kompatibilní.

# e_IndexesInProperty
source: Cannot get property index parameters.
cs: Nemohu zístak indexové paramery vlastnosti.

# NoPropertyAccesor
source: Property has no accessor.
cs: Vlastnost nemá žádné metody.

# SetterSpecialName
source: Property setter shall be marked specialname.
cs: Setter vlastnosti musí být označen specialname.

# GetterSetterStatic
source: Property getter and setter must both be static or both be instance.
cs: Setter i getter vlastnosti musí být oba buď statické nebo instanční.

# GetterSetterVirtual
source: Property getter and setter must both be virtual or both be non-virtual.
cs: Setter i getter vlastnosti musí být oba buď virtuální nebo nevirtuální.

# GetterSpecialName
source: Property getter shall be marked specialname.
cs: Getter vlastnosti musí být označen spacialname.

# ParametersInGetter
source: Cannot get parameters of property getter.
cs: Nemohu získat parametry getteru vlastnosti.

# GetterType
source: Property getter return type shall be same as type of property.
cs: Návratový typ getteru vlastnosti musí být stejný jako typ vlastnosti.

# GetterParametersCount
source: Number of parameters of property and of getter shall be same.
cs: Počet parametrů vlastnosti a getteru musí být stejný.

# GetterName
source: Property getter name shall be get_<property name> (expected "{0}", actual "{1}").
cs: Název getteru vlastnosti musí být get_<název vlastnosti> (očekáváno "{0}", skutečně "{1}").

# e_ParametersInSetter
source: Cannot get parameters of property setter.
cs: Nemohu získat paremetry getteru vlastnosti.

# SetterLastParam
source: Type of last parameter of property setter shall be same as type of property.
cs: Typ posledního parametru setteru vlastnosti musí být stejný jako typ vlastnosti.

# SetterParametersCount
source: Property setter shall have exactly one more parameter than property itself.
cs: Setter vlastnosti musí mít přesně o jeden parametry více než vlastnost.

# SetterName
source: Property setter name shall be set_<property name> (expected "{0}", actual "{1}").
cs: Název setteru vlastnosti musí být set_<název vlastnosti> (očekáváno "{0}", skutečně "{1}").

# IndexType
source: Property index parameter type {0} is not CLS-compliant.
cs: Indexový parametry proměnné {0} není CLS-kompatibilní.

# PropertyByRef
source: Property parameter shall not be passed by reference.
cs: Parametry vlasnosti nesmí být předáván referencí.

# PropertySetterParameters
source: Property setter parameters shall be same as property parameters (except for last setter parameter).
cs: Parametry setteru vlastnosti musí být stejných typů jako parametry vlastnosti (až na poslední parametr setteru).

# PropertyGetterParameters
source: Property getter parameters shall be same as property parameters.
cs: Parametry getteru vlastnosti musí být stejné jako parametry vlastnosti.

# Modreqs
source: CLS does not allow required modifiers (modreqs).
cs: CLS nepovoluje povinné uživatelské modifikátory (modreq).

# EventType
source: Event delegate type is not CLS-compliant.
cs: Type delegáta události není CLS-kompatibilní.

# AddRemoveBothOrNo
source: Event methods add remove shall be both present or both absent.
cs: Metody události add a remove musí být buď obě přítomny nebo obě nepřítomny.

# EventTypeDelegate
source: Event type shall be delegate.
cs: Type události musí být delegát.

# AddSpecialName
source: Event method add shall be marked specialname.
cs: Metoda události add musí být označena jako specialname.

# AddParameters
source: Event method add shall take exactly one parameters of type of type of event delegate.
cs: Metoda události add musí přijímat právě jeden parametry typu delegáta události.

# AddName
source: Event method add shall be named add_<event name>.
cs: Název metody události add musí být pojmenována add_<název události>.

# RemoveSpecialName
source: Event method remove shall be marked specialname.
cs: Metoda události remove musí být označena jako specialname.

# EventAccessorsVisibility
source: Event accessors shall have same accessibility.
cs: Metody události musí mít stejnou úroveň přístupu.

# RemoveParameters
source: Event method remove shall take exactly one parameters of type of type of event delegate.
cs: Metoda události remova musí přijímat právě jeden parametr typu delegáta události.

# RemoveName
source: Event method remove shall be named remove_<event name>.
cs: Metoda události remove musí být pojmenována remove_<neázev události>.

# RaiseSpecialName
source: Event method raise shall be marked specialname.
cs: Metoda události raise musí být označena jako specialname.

# RaiseName
source: Event method raise shall be named raise_<event name>.
cs: Metoda události raise musí být pojmenována raise_<název události>.

# OverrididedLevel
source: Overriding method shall have same access level as method it overrides. Only familly-or-assembly accessibility can be changed to familly when overriding method is in different assembly then method it overrides.
cs: Přepisující metoda musí mýt stejnou úroveň přístupnosti jako metoda, kterou přepisuje. Jen dostupnost sestavení nebo rodina může být změněna na dostupnost rodina, pokud je přepisující metoda v jiném sestavení, než metoda, kterou přepisuje.

# e_ParamsInMethod
source: Error while getting parameters of method
cs: Chyba při získávání parametrů metody.

# ParamType
source: Parameter {0} is not of CLS-compliant type.
cs: Parametr {0} není CLS-kompatibilního typu.

# ReturnType
source: Return type of method is not CLS-compliant.
cs: Návratový typ metody není CLS-kompatibilní.

# StandardCallingConvention
source: Only supported calling convention is standard.
cs: Jediná podporovaná volací konvence je standardní.

# GenericParamType
source: Type {0} passed to generic type is not CLS-compliant.
cs: Typ {0} předaný do generického typu není CLS-kompatibilní.

# IncompliantType
source: Type {0} is not CLS-compliant.
cs: Typ {0} není CLS-kompatibilní.

# TypedReference
source: TypedReference is noc CLS-compliant.
cs: TypedReference není CLS-kompatibilní.

# Array0
source: Array must have lower bound 0 in each dimension.
cs: Pole musí mít spodní mez 0 ve vešech rozměrech.

# Pointer
source: Unmanaged pointer are not CLS-compliant.
cs: Nespravované ukazatele nejsou CLS-kompatibilní.

# FieldType
source: Field type is not CLS-compliant.
cs: Typ proměnné není CLS-kompatibilní.

# ConstantValue
source: Constant value specified in metadata is not of same type as is type of the field.
cs: Konstantní hodnota specifikovaná v metadatech není stejného typu jako je typ proměnné.

# e_CustomAttributes
source: Cannot get custom attributes.
cs: Nemohu získat uživatelské atributy.

# NoAttributeAttribute
source: Attribute type {0} does not derive from System.Attribute.
cs: Typ atributu {0} nedědí od System.Attribute.

# CLSInclompliantAttribute
source: CLS-inclompliant attribute {0} used.
cs: Použití CLS-nekompatibilního atributu {0}.

# CustomAttributeDataInaccessible
source: Cannot check custom attribute data on {0}, becasue it does not provide access to custom attribute data.
cs: Nemohu ověřit data uživatelských atributů pro {0}, protože {0} neposkytuje přístup k datům uživatelských atributů.

# AttributeParamType
source: Custom attribute {0} constructor value is encoded using CLS-unsupported type {1}.
cs: Hodnota konstruktoru uživatelského atributu {0} je kódována za použití CLS-nekompatibilního typu {1}.

# AttributeNamedParamType
source: Custom attribute {0} named parameter value for {1} is encoded using CLS-unsupported type {2}.
cs: Hodnota pojmenovaného parametru {0} uživatelského atributu {1} je kódována za použití CLS-nekompatibilního typu {2}.

# Name
source: Name "{0}" is not CLS-compliant.
cs: Název "{0}" není CLS-kompatibilní.

# NameC
source: Name "{0}" is not stored in Unicode Normalization Form C.
cs: Název "{0}" není uložen v Unicode normalizační formě C.

# UniqueName
source: Culture-invariant lowercase representation of type name "{0}" is not unique.
cs: Kulturně invariantní reprezentace názvu typu "{0}" malými písmeny není unikátní.

# ExposeFriend
source: {0} exposes type {1}, which is not accessible from outside of assembly.
cs: {0} vystavuje typ {1}, který není dostupný zvenčí sestavení.

# ExposeNested
source: {0} exposes type {1}, which is not accessible from outisde of type {2}.
cs: {0} vystavuje typ {1}, který není dostupný z venčí typu {2}.

# e_GenericParametersInType
source: Cannot get generic parameters of type {0}.
cs: Nemohu získat generické parametry typu {0}.

source: VarArgs are not CLS-compliant.
cs: VarArgs nejsou CLS-kompatibilní.
