Repository: DzonnyDZ/Tools
Catalog: Tools/Resources/resx (Friend)/Components.*.resx
Languages: cs

# AllowClose_d
source: Value indicationg if dialog can be closed without clicking on button. Thi is typically by closing the window that represents the dialog by the "X" button.
cs: Hodnota určující jestli dialog může být zavřen bez kliknutí na tlačítko. To je typicky zavření okna reprezentujícího dialog pomocí tlačítka "X".

# Buttons_d
source: Defines buttons displayed on message box
cs: Defunuje tlačítka zobrazená na message boxu.

# DefaultButton_d
source: indicates 0-based index of button that has focus when message box is shown and is default button for message box (usually reported when user presses enter).
cs: Určuje 0 začínající index tlačítka, které bude mít fokus, když bude message box zobrazen, a které je výchozím tlačítkem pro message box (typicky použito, když uživatel stiskne enter).

# CloseResponse_d
source: Value returned by the Show function / DialogResult property when user closes the dialog by closing dialog window or by pressing escape
cs: Hodnota vrácená funkcí Show / vlastností DialogResult, když uživatel zavře dialog zavřením okna nebo stiskunutím escape.

# Prompt_d
source: Text of prompt displayed to the user.
cs: Zpráva zobrazená uživateli.

# Title_d
source: Title shown in dialog header
cs: Titulek zobrazený v záhlaví dialogu

# Icon_d
source: Icon shown in left to corner (lrt) of dialog
cs: Ikona zobrazená v levém horním roku (ltr) dialogu

# Options_d
source: Addtional options controlling how dialog is displayed
cs: Doplňkové volby kontrolující jak bude dialog zobrazen

# CheckBoxes_d
source: Check boxes displayed for message box. Can be used for example for 'Do not show this message in future' option.
cs: Zaškrtávátka zobrazená na message boxu. Mohou být použita například pro volbu 'Příště již tuto zprávu nezobrazovat'.

# ComboBox_d
source: Combo box displayed on dialog
cs: Combo box zobrazený na dialogu

# Radios_d
source: Radio buttons (options) displayed on messagebox
cs: Přepínače (volby) zobrazené na message boxu

# Timer_d
source: Inidcates how long the message box will be show to user before being closed automatically. If zero or less, no count-down takes effect.
cs: Určuje jak dlouho bude message box zobrazen uživatel, před tím než se sám zavře. Pokud je 0 nebo méně, žádné odpočítávání se nekoná.

# TimeButton_d
source: Indicates 0-based index of button which displays the count-down timer. It aslo defines result of dialog returned when time elapses. -1 chose button automatically acording to CloseResponse, <-1 displays count-down in title, > number of buttons hides count-down indicator.
cs: Určuje 0 začínající index tlačítka, které zobrazuje čítač odpočítávání. Také určuje návratovou hodnotu dialogu, když uběhne čas. -1 vybere tlačítko automaticky podle CloseResponse, <-1 zobrazí čítač v váhůlaví, > počet tlačítek schová čítač.

# MessageBoxButton_Text_d
source: Text displayed on the control
cs: Text zobrazený na ovládacím prvku

# ToolTip_d
source: Tool tip text (help) for control
cs: Nápovědný text (tool tip) ovládacího prvku

# Enabled_d
source: Indicates if control is enabled, so user can interact with it.
cs: Určuje jestli ovládací prvek je povolen, takže uživatel s ním může pracovat.

# ClickPreview_d
source: Raised when user clicks the button. Can be canceled.
cs: Vyvolána, když uživatel klikne na tlačítko. Může být stornována.

# Result_d
source: Result of message box returned when this button is clicked.
cs: Návratová hodnota message boxu, když uživatel klikne na dané tlačítko.

# AccessKey_d
source: Access character for the button. Should be one of characters from button text.
cs: Přístupový znak tlačítka. Měl by být jedním ze znaků textu tlačítka.

# StateChanged_d
source: Raised ehrn value of the State property changed
cs: Vyvolána, když se změní hodnota vlastnosti State

# ThreeState_d
source: Indicateis if checkbox has 3rd intermediate state
cs: Určuje jestli zaškrtávátko má 3., mezilehlý, stav

# State_d
source: Current check state of check box
cs: Aktuální stav zaškrtnutí zaškrtávátka

# Editable_d
source: Indicates if user can change text of combo box (true) or must select only form list of predefined values (false).
cs: Určuje jestli uživatel může změnit text ovládacího prvku (true) nebo musí vybrat jedině jednu z hodnot ze seznamu předdedfinovaných (false).

# Items_d
source: Items shown to user in drop down. Item can be any Object.
cs: Položky zobrazené uživateli v rozbalovacím seznamu. Mohou jimy být libovolné objekty.

# DisplayMember_d
source: Indicates member (property, field) used to obtain text to be shown to user for each item.
cs: Určuje člena (vlastnost, proměnnou) použitého k získání textu zobrazeného uživateli pro každou položku.

# SelectedIndex_d
source: Indicates 0-based index of selected item in combo box.
cs: Určuje0 začínající index položky vybrané v kombo boxu.

# SelectedItemChanged_d
source: Raised when value of the SelectedItem property changes
cs: Vyvolána, když se změní hodnota vlastnosti SelectedItem

# SelectedIndexChanged_d
source: Raised when value of the SelectedIndex property changes.
cs: Vyvolána, když se změní hodnota vlastnosti SelectedIndex.

# Checked_d
source: Indicates of option is selected
cs: Indikuje jestli volba je vybrána

# CheckedChanged_d
source: Raised when value of the Checked property changes
cs: Vyvolána, když se změní hodnota vlastnosti Chacked

# CountDown_d
source: Raised when count-down time ticks - once a second.
cs: Vyvolána, když dojde k tiknutí čítače odpočítávání - jednou za sekundu.

# Shown_d
source: Raised after dialog is shown
cs: Vyvolána po zobrazení dialogu

# Closed_d
source: Raised after dialog is closed
cs: Vyvolána po zavření dialogu
