Repository: DzonnyDZ/Tools
Catalog: Tools/Resources/resx (Friend)/CompositeControls.*.resx
Languages: cs

# AutoCompleteCacheName_d
source: Name of per-session cache of keywords used by this instance
cs: Název per-session chache klíčových slov používaných touto instací

# CaseSensitive_d
source: Gets or sets value idicating if keywords are case sensitive
cs: Získá nebo nastaví hodnotu určující jestli klíčová slova jsou case sensitive

# StatusState_d
source: Gets or sets state of Status
cs: Získá nebo bastaví stav Statusu

# Status_d
source: StatusMarker present on this control
cs: StatusMarker používaný na tomto ovládacím prvku

# ThesaurusButtonAttribute_d
source: Gets or sets state of thesaurus button
cs: Získá nebo nastaví stav tlačítka tezauru

# MergeButtonState_d
source: Gets or sets state of merge button
cs: Získá nebo nastaví stav tlačítka slučování

# Merge_d
source: Gets or sets value indicating if merge button is checked (orange) or not (gray)
cs: Získá nebo nastaví jestli tlačítko slučování je zaškrtnuto (oranžové) nebo ne (šedivé)

# MergeChanged_d
source: Raised after value of the Merge property changed
cs: Vyvolána po změně hodnoty vlastnosti Merge

# AutoChange_d
source: Gets or sets value indicating if Status.Status automatically changes when keyword is added or removed
cs: Získá nebo nastaví hodnotu určující jestli Status.Status se automaticky změní, když je klíčové slovo přidáno nebo odstraněno

# KeyWordRemoved_d
source: Raised after user manually removes keyword(s)
cs: Vyvolána po té, co uživatel ručně odebere klíčové/á slova/o

# AddMenuState_d
source: State of the Add menu item
cs: Stav položky menu přidat

# DeleteMenuState_d
source: State of the Delete menu item
cs: Stav položky menu odebrat

# MarkAsChangedMenuState_d
source: State of the Mark-as-changed menu item
cs: Stav menu Označit jako změněné

# ResetMenuState_d
source: State of the Reset menu item
cs: Stav menu Reset

# AutoChanged_d
source: Gets or sets value indicating if Status automatically changes to Statuses.Changed when tmiMarkAsChanged is clicked
cs: Získá nebo nastaví hodnotu určující jestli se Status automaticky změní na Statuses.Changed, když tmiMarkAsChanged je kliknuto

# StatusMarkerStatus_d
source: Shown status of control
cs: Zobrazený sttus ovládacího prvku

# StatusChanged_d
source: Raised after the Status property changes
cs: Vyvolána po té co se změné vlastnost Status

# Add_d
source: Raised after Add menu item is clicked
cs: Vyvolána po té co je kliknuto ne položku menu Přidat

# MarkAsChanged_d
source: Raised after Mark-as-changed menu item is clicked
cs: Vyvolána po té co je kliknuto na položku menu Označit jako přečtené

# Reset_d
source: Raised after Reset menu item is clicked
cs: Vyvolána po té co je kliknuto na položku menu Reset

# Delete_d
source: Raised after Delete menu item is clicked
cs: Vyvolána po té co je kliknuto na položku menu Odstranit

source: Deleted
cs: Odstraněno

source: Changed
cs: Změněno

source: New
cs: Nové

source: Normal
cs: Normální

source: Null
cs: Nenastaveno

# AutomaticLists_d
source: Indicates if editor uses automatically shared lists of keywords and synonyms (among instances with same AutoCompleteCacheName) or not.
cs: Určuje jestli editor automaticky používá sdílené seznamy klíčových slov a synonym (mezi instancemi se stejným AutoCompleteCacheName) nebo ne.
