Repository: DzonnyDZ/Tools
Catalog: Tools/Resources/resx (Friend)/Exceptions.*.resx
Languages: cs

source: Syntax error in format string. Unexpected end of format string in condition at {0}. Number expected.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný konec formátovacího řetězce v podmínce na pozici {0}. Očkáváno číslo.

source: Syntax error in format string. Unextected character '{0}' in condition at {1}. Number expected.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný znak '{0}' v podmínce na pozici {1}. Očekáváno číslo.

source: Syntax error in format string. Unexpected end of format string in condition at {0}. Expected number or ')'.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný konec formátovacího řetězce v posmínce na pozici {0}. Očekáváno číslo nebo ')'.

source: Syntax error in format string. Unextected character '{0}' in condition at {1}. Expected number or ')'.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný znak '{0}' v podmínce na pozici {1}. Očekávano číslo nebo ')'.

source: Syntax error in format string. Unexpected end of format string in condition at {0}. Number, '.' or ':' expected.
cs: Syntaktická chyba ve formátovacím řetězci. Nečekávaný konec formátovacího řetězce v podmínce na pozici {0}. Očekáváno číslo, '.' nebo ':'.

source: Syntax error in format string. Unextected character '{0}' in condition at {1}. Number, '.' or ':' expected.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný znka '{0} v podmínce na pozici {1}. Očekáváno číslo, '.' nebo ':'.

source: Syntax error in format string. Unexpected end of format string in condition at {0}. Number or ':' expected.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný konec formátovacího řetězce v podmíce na pozici {0}. Očekáváno číslo nebo ':'.

source: Syntax error in format string. Unextected character '{0}' in condition at {1}. Number or ':' expected.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný znak '{0}' v podmíce na pozici {1}. Očekáváno číslo nebo ':'.

source: Syntax error in format string. Unexpected end of format string in condition at {0}. Number or '.' expected.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný konec fromátovacího řetězce v podmínce na pozici {0}. Očekáváno číslo nebo '.'.

source: Syntax error in format string. Unextected character '{0}' in condition at {1}. Number or '.' expected.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný znak '{0}! v podmínce na pozici {1}. Očkáváno číslo nebo '.'.

source: Syntax error in format string. Unexpected end of fomat string at {0}. Expected ')' for condition.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný konec formátovacího řetezce na pozici {0}. Očekáváno ')' pro podmínku.

source: Unsupported type for comparison ({0}).
cs: Nepodporovaný typ porovnání ({0}).

source: Value of some type was passed where it is not acceptable.
cs: Hodnota určitého typu byla přadána tam, kde nebyla akceptována.

source: Only values of type {0} are acceptable
cs: Jen hodnoty typu {0} jsou akceprovatelné.

source: Value of type {0} is not acceptable.
cs: Hodnota typu {0} je nekaceptovatelná.

source: Value of unexpected type {0}. Expected {1}.
cs: Hosnota neočekávaného typu {0}. Očekáváno {1}.

source: Unknown underlying type {0}
cs: Neznámý základní typ {0}

# MustBeEnumeration
source: {0} must be enumeration
cs: {0} musí být výčet

source: Constant {0} does not exist in type {1}
cs: Konstanta {0} neexistuje v typu {1}

source: Enumeration does not allow negative values
cs: Výčet neumožňuje záporné hodnoty

source: Encoding with same codepage is not in list
cs: Kódování se stajnou znakovou stránkou není v seznamu

# CannotBeNull
source: {0} cannot be null
cs: {0} nemůže být null

source: Given value is not known system sound
cs: Daná hodnota není známý systémový zvuk

source: Only sounds with known location can be converted
cs: Jen zvuky se známým umístěním lze převést

source: Only sounds of type SystemSoundPlayer and SoundPlayerWrapper are supported
cs: Jen zvoky typu SystemSOundPlayer a SoundPlayerWrapper jsou podporovány

source: SystemSoundPlayerWrapper can be converted only when it provides sound location.
cs: SystemSoundPlayerWrapper může být konvertován jen, když poskytuje umístění zvuku.

source: Cannot convert given {0} to {1} because it does not represent known {2}.
cs: Nemohu konvertovat daný {0} na {1} protože nereprezentuje známý {2}.

source: Type {0} is not supported as value of StatusedControl property.
cs: Typ {0} není podporován jako hodnota vlastnosti StatusedControl.

source: Text cannot be changed via the Text property
cs: Text nelze změnit pomocí vlastnosti Text.

# CannotBeSet
source: {0} cannot be set.
cs: {0} nelze nastavit.

source: LinkLabel internal exception: Link for item not found
cs: Vnitřní chyba LinkLabelu: Odkaz pro položku nenalezen

source: Cannot locate {0} in {1}
cs: Nemohu najít {0} v {1}

source: LinkLabel internal error: Item found in Items but not found in Links
cs: Vnitřní chyba LinkLabelu: Položka nalezena v Items ale nenalazena v Links.

# NotFoundIn1
source: {0} not found in {1}
cs: {0} nenalezena v {1}

source: Error while deserializing {0}
cs: Chyba při deserializace {0}

source: Value can be converter neither to {0} nor to {1}
cs: Hodnota nemůže být převedena ani na {0} ani na {1}

source: Type {0} is not supported
cs: Typ {0} není podporován

# MustBe1
source: {0} must be {1}
cs: {0} musí být {1}

source: All types in {0} must inherit from {0}
cs: Všechny typy v {0} musí dědit od {0}

source: Cannot create instance of type {0}. {1} was thrown when obtaining new instance:
cs: Nemohu vytvořit instanci typu {0}. {1} byla vyhozena při získávání nové instance:

source: Value of type {0} cannot be converted to {1}.
cs: Hodnota typu {0} nemůže být konvertována na {1}.

# MustBeOneOf1Or2Values
source: {0} must be one of {1} or {2} values
cs: {0} musí být jedna z hodnot {1} nebo {2}

source: Conversion to {0} failed
cs: Konverze na {0} selhala

source: Property is read only
cs: Vlastnost je jen ke čtení

source: The Previous property of IFD being set as following must be null
cs: Vlastrnst Previous IFD nastavovaného jako následující musí být null

source: Attempt to create cyclic linked-list of IFDs
cs: Pokus vytvořt cyklický spojový seznam IFD

source: Following IFD cannot be SubIFD
cs: Následující IFD nemůže být podIFD

source: Following IFD must be member of same Exif or be member of no Exif as current IFD.
cs: Následující IFD musí být členem stejného Exif nebo nabýt členem žádného Exif jako aktuální IFD.

source: Given IFD is already in use
cs: Dané IFD je již použito

source: Cannot set value of the Exif property to other instance then is value of Exif property of Previous IFD.
cs: Nemohu nastavit hodnotu vlastnosti Exif na jinou instance než je hodnota vlastnsti Exif předchozího IFD.

source: IFD passed to the IFD0 property must either have no Exif asociated or must have associated currrent instance.
cs: IFD předané do vlastnsti IFD0 buďto nesmí mít žádný asociovaný Exif nebo musí mýt stejný Exif jako je aktuální instance.

source: IFD passed to the IFD0 property cannot have the Previous property set.
cs: IFD předané do vlastnosti IFD0 nesmí mýt nastavenu vlastnost Previous.

source: Type of IFD following after IFD0 must be IFDMain
cs: Typ IFD následujícího po IFD0 musí být IFDMain

# CanNeverContainItemWithKeyOfType1
source: {0} can never contain item with key of type {1}
cs: {0} nesmí nikdy obsahovat položku s klíčem typu {1}

source: Given key is already present in the dictionary
cs: Daný klíč je již přítomen ve slovníku

source: Collection is read-only
cs: Kolekce je jen pro čtení

source: Value was not found
cs: Hodnota nenalezena

source: SubIFD key must be valid UInt16 value
cs: Klíč podIFD musí být platná hodnota typu UInt16

source: Exif record key must be valid UInt16 value
cs: Klíč záznamu Exif musí být platná hodnota typu UInt16

source: "Exif pof subIFD being added/replaced must be either null or same as Exif of parent IFD
cs: Exif podIFD, které je přidáváno/kterým je nahrazováno, musí být null nebo stajný jako Exif rodičovského IFD

source: ParentIFD of subIFD being added/replaced must me null.
cs: ParentIFD nastavovaného/nahrazovavšího podIFD musí být null.

source: If parent IFD already contains record that is about to become parent record of subIFD it must of type one element of type UInt32
cs: Když rodičovské IFD již obsahuje záznam, ktarý se stávaá rodičem podIFD, musí být typ záznamu jedna položka typu UInt32

# MustBeWithinRangeOfValuesOfType1
source: {0} must be within range of values of type {1}.
cs: {0} musí být v rozsahu položek typu {1}

source: SubIFD
cs: PodIFD

source: You should not replace records which serves as pointers to subIFDs. If you do so replacement record must be of type UInt16 with one element, fixed length.
cs: Neměli byste nahrazovat záznamy, které slouží jako ukazatela na podIFD. Pokud tak čníte, nahrazující záznam musí být typu UInt16 s jedním elementem, fixní délka.

source: Cannot remove record which poits to subIFD. Remove subIFD first.
cs: Nemohu odstranit záznam ukazující na podIFD. Nejprve odstraňte podIFD.

source: The {0} property have already been initialized.
cs: Vlastnost {0} již byla inicializována.

source: The Tags property have not been initialized. Use the SetTags method to initialize it.
cs: Vlastnost Tags nebyla inicializována. Použijte SetTags k jají inicializaci.

source: Root element of {0} must be {1}.
cs: Kořenový element {0} musí být {1}.

# MustRepresentXMLElement1
source: {0} must represent XML element {1}
cs: {0} musí reprezentovat XML element {1}

source: Unknown ISO-2022 encoding type {0}
cs: Neznámý typ kódování ISO-2022 {0}

source: Error while parsing {0}. Found '{1}', expected {2} at position {3}.
cs: Chyba při parsování {0}. Nalezeno '{1}', očekáváno {2} na pozici {3}.

source: Escape sequence string is in invalid format.
cs: řetězec escape sekvence je v neplatném formátu.

source: Given stream does not support reading
cs: Daný proud nepodporuje čtení

source: Key {0} can hold only IFD of type {1}
cs: Klíč {0} může obsahovat jen IFD typu {1}

source: For uncompressed thumbnail StripOffsets and StripByteCounts must have same length
cs: Pro nekomprimovanou miniaturu musí StripOffsets a StripByteCounts mít stejnou délku

source: This stream does not support seeking.
cs: Tento proud nepodporuje změnu pozice.

source: This stream does not support writing.
cs: Tento proud nepodporuje zápis.

source: Attempt to seek after end of stream.
cs: Pokus nastavit pozici za konec proudu.

source: When {0} is {1} then {2} must be set
cs: Když {0} je {1}, {2} musí být nastaveno

source: Thumbnail data are invalid
cs: Data miniatury jsou neplatná

# IsNotMemberOf1
source: {0} is not member of {1}.
cs: {0} není členem {1}

# CannotBeSetTo1When2Is3
source: {0} cannot be set to {1} when {2} is {3}
cs: {0} nemůže být nastavena na {1} když {2} je {3}

source: Stream representing Exif metadata item must support seeking and reading.
cs: Proud reprezentující položku Exif metadat musí podporovat změnu polohy a čtení.

source: Value of the {0} property cannot be changed after it was set.
cs: Hodnota vlastnosti {0} nemůže být změněka, po té co byla nstavena.

source: ExifMapGenerator cannot be attached to multiple readers
cs: ExifMapGenerator nemůže pýs spojen s více čiteči

source: BaseStream of OverflowStream must be able to Read, Write and Seek.
cs: BaseStram OverflowStreamu musí umět číst, zapisova a měnit polohu.

# WasGreaterThanLegnthOf2
source: {0} + {1} was greater than legnth of {2}.
cs: {0} + {1} bylo větší než délka {2}.

source: Unsupported source type
cs: Nepodporovaný typ zdroje

source: Unsupported target type
cs: Nepodporovaný typ cíle

source: This converter can convert only from {0}.
cs: Tento převodník může převádět jan z {0}.

source: This converter can convert only to {0}.
cs: Tento převodník může převádět jen do {0}.

source: This converter can convert back only from {0}.
cs: Tento převodník může převádět zpet jen z {0}.

source: This converter can convert back only to {0}.
cs: Tento přavaděč může převádět zpět jen do {0}.

source: There are not enought items in {0}
cs: V {0} není dostatečný počet položek

# MustBeMemberOf0CollectionOf2
source: {0} must be member of {1} collection of {2}
cs: {0} musí být člen {1} kolekce {2}

source: Unsupported type of MemberInfo of named argument of attribute
cs: Nepodporovaný typ MemberInfo pojmenovaného argumentu atributu

source: When Stage is GetCustomAttributeDate or GetCustomAttributes CustomAttribuetData must be null and ArgumentIndex must be -1
cs: Když Stage je GetCustomAttributeData nebo GetCustomAttributes, CustomAttributeData musí být null a ArgumentIndex musí být -1

source: When Stage is GetConstructorArguments, GetNamedArguments, InvokeConstructor, GetConstructorArgumentValue, SetField, SetProperty, InvokeMethod or GetNamedArgumentValue CustomAttributeData cannot be null.
cs: Když Stage je GetConstructorArguments, GetNamedArguments, InvokeConstructor, GetConstructorArgumentValue, SetField, SetProperty, InvokeMethod nebo GetNamedArgumentValue, CustomAttributeData nesmí být null.

source: When Stage is GetConstructorArgumentValue, ArgumentIndex must be within range of CustomAttributeDate.ConstructorArguments
cs: Když Stage je GetConstructorArgumentValue, ArgumentIndex musí být z rozsahu CustomAttributeDate.ConstructorArguments

source: When Stage is GetConstructorArgumentValue, ArgumentIndex must be within range of CustomAttributeDate.NamedArguments
cs: Když Stage je GetConstructorArgumentValue, ArgumentIndex musí být z rozsahu CustomAttributeDate.NamedArguments

source: Attribute cannot derive from Attribute when WarningKind is NoAttributeAttribute
cs: Atribut nesmí dědit ot Attribute, když WarningKind je NoAttributeAttribute

source: Exif stream and map must have same lengths
cs: Prod Exif a mapa musí mít stejnou délu

source: Stream to write Exif medatada to must support reading, writing and seeking.
cs: Proud k zápisu Exif metadta musí podporovat čtení, zápis a změnu pozice

source: Original Exif stream must be al least 12 bytes long.
cs: Původní proud Exif metadat musí mít alespoň 12 bytů délky.

source: Supplied stream has invalid byte order marker.
cs: Dodaný proud má neplatnou značku pořadí bytů.

source: Supplied stream byte order does not match byte order test word.
cs: Značka pořadí bytů v dodaném proudu neodpovídá testovacímu slovu.

source: The beginnign of Exif map is invalid
cs: Začátek Exif mapy je neplatný

source: Unexpected call of {0}
cs: Neočekávané volání {0}

source: Exif map is invalid because it contains writer-generated items
cs: Exif mapa je neplatná protože obsahuje zapisovačem generované položky

source: PreserveThumbnail cannot be changed after writing of data started.
cs: PreserveThumbnail nelze změnit, když zapisování dat již začalo.

source: Thumbnail can be preserved only if Exif writer operates over already-existing stream of Exif metadata.
cs: Miniatura může být zachována jen pokud zapisovač Exif operuje nad již existujícím proudem Exif metadat.

# MustBeGreaterThanOrEqualTo1
source: {0} must be greater than or equal to {1}.
cs: {0} musí být větší než nebo rovna {1}.

source: Cannot write IFD at this time.
cs: Nyní nelze zapsat IFD.

source: Records can be written only when WriterState is Records
cs: Záznamy lze zapisovat jen pokud WriterState je Records

source: All records have benn already written.
cs: Všechny záznamy již byly zapsány.

source: Type {0} is not acceptable for data type {1}.
cs: Tpy {0} není akceptovatelný pro datový typ {1}.

source: Number of items of {0} differs from {1}
cs: Počet položek v {0} je jiné než {1}

source: Length of {0} must be non-zero
cs: Délka {0} musí být nenulová

source: Only allowed values for BlobType are Unknown, JpegThumbnail and TiffThumbnailPart
cs: Jediné povolené hodnoty pro BlobType jsou Unknow, JpegThumbnail a TiffThumbnailPart

# MustBeEqualToOrGreaterThan1
source: {0} must be equal to or greater than {1}
cs: {0} musí být stejná nebo větší než {1}

source: Finnishig is not allowed in state {0}
cs: Ukončení není dovoleno ve stavu {0}

source: Writer is not initialized or is finished
cs: Zapisovač není inicializován enbo je ukončen

source: Image data does not contain enogh bytes
cs: Obrazová data neobsahují dostatečný počet bytů
