Repository: DzonnyDZ/Tools
Catalog: Tools/Resources/resx (Friend)/Exceptions.*.resx
Languages: cs

source: Type must inherit from MessageBox
cs: Type musí dědit od MessageBox

source: Default MessageBox implementation cannot be abstract type.
cs: Výchozí implementace MessageBoxu nesmí být abstraktní typ.

source: Default MessageBox implementation cannot be generic type definition.
cs: Výchzí implementace MessageBoxu nemí být definice generického typu.

source: Class that represents default MessageBox implementation must have parameter-less constructor.
cs: Třída reprezentující výchozí implementaci MessageBoxu musí mít konstruktor bez parametrů.

source: Result cannot be None
cs: Result nemůže být None

source: Cannot resume count-down timer when there is no time left.
cs: Není možno obnovit odpočítávání, když nezbývá žádný čas.

source: Count down time must be greater than zero.
cs: Čas odpočítávání musí být větší než nula.

source: MessageBox cannot be re-cycled when it is shown.
cs: MessageBox nemůže být recyklován, když je zobrazen.

source: RecycleInternal can be called only on closed messagebox.
cs: RecycleInternal je možno volat jen na zavřaném message boxu.

source: Class cannot be used as message box.
cs: Třída nemůže být použita jako message box.

source: There was an error obtainin instance of default implementation of MessageBox. See inner exception for details.
cs: Při získávání instance výchozí implementace MessageBoxu došlo k chybě. Vizte InnerException pro detaily.

source: There was an error invoking MessageBox. See inner exception for details.
cs: Při volání MessagBoxu došlo k chybě. Vizte InnerException pro detaily.

# WasNotMemberOf
source: {0} was not member of {1}
cs: {0} nebyl členem {1}

source: The CollectionChangeAction.Other action and actions that are not members of the CollectionAction enumeration are not supported on {0} collection.
cs: Akce CollectionChangeAction.Other a akce, které nejsou členem CollectionAction nejsou podporovány na kolekci {0}.

source: MessageBox must be in Created State in order to be displyed by PerformDialog.
cs: MessageBox musí být ve stavu Created, aby mohl být zobrazen pomocí PerformDialog.

# MustBeGreaterThanOrEqualToZero
source: {0} must be greater than or equal to zero
cs: {0} musí být větší nebo rovno nule

# MustBe1Dimensional
source: {0} must be 1-dimensional
cs: {0} musí být jednorozměrné

source: There is not enough space between {0} and the end of the array for items stored in collection
cs: Mezi {0} a koncem pole není dostatek místa pro položky z kolekce

source: Enumerator is positioned outside IReadOnlyIndexable bounds
cs: Enumerator je napozicován mimo hranice IReadOnlyIndexable

source: AllowAddCancelableEventsHandlers can be changed only from True to False
cs: AllowAddCancelableEventHandlers lze změnit jen z True na False

source: Cannot add handler to the Adding event when AllowAddCancelableEventsHandlers is False
cs: Nemohu přidat ovladač události Adding, když AllowAddCancelableEventHandlers je False

source: List is locked
cs: List je zamčen

source: Cannot add handler to the Clearig event when AllowAddCancelableEventsHandlers is False
cs: Nemohu přidat ovladač události Clearing, když AllowAddCancelableEventHandlers je False

source: Clearing was canceled in eventhendler
cs: Čištění bylo stronováno v ovladači události

source: Cannot add handler to the Removing event when AllowAddCancelableEventsHandlers is False
cs: Nemohu přidat ovladač události Removing, když AllowAddCancelableEventsArgs je False

source: Removing was cenceled in event handler
cs: Odstraňování bylo stronováno v ovladači události

source: Cannot add handler to the ItemChanging event when AllowAddCancelableEventsHandlers is False
cs: Nemohu přidat ovladač události ItemChanging, když AllowAddCancelableEventsHandlers je False

source: Changing was canceled in eventhandler
cs: Změna byla stronována v ovladači události

source: Cannot change Item property when ReadOnly is True
cs: Nemohu změnit položku Item, když ReadOnly je True

source: Error while deserializing LinkLabelItem
cs: Chyba pži deserializaci LinkLabelItem

source: Enumerator is either not initialized yed or enumeration has already finished
cs: Enumerator buďto ještě není inicializován nebo enumarace již skončila

# CannotBeSetToNull
source: {0} cannot be set to null
cs: {0} nelza nastavit na null

source: Only IList instances can be used in ListWrapper
cs: S ListWrapperem lze použít jen instance IListů

# MustBeNonNegative
source: {0} must be non-negative
cs: {0} musbýt nezáporné

# IsMultidimensional
source: {0} is multidimensional
cs: {0} je vícerozměrné

# IsGreaterThanOrEqualToLenghtOfArray
source: {0} is greater than or equal to lenght of array
cs: {0} je větší než nebo rovno délce pole

source: There is not engough space in array after {0} to place all items from collection
cs: Za {0} není v poli dostatek místa pro uložení všech položek kolekce

source: index was out of range of controls collection.
cs: index byl mimo rozsah kolekce ovládacích prvků

source: index must be in range of the collection.
cs: index musí být v rozsahu kolekce

source: String must consist of event number of hexadeimal numerals
cs: Řetězec musí obsahovat lichý počet hexačíslic

source: Invalid character near "{0}{1}"
cs: Neplatný znak poblíž "{0}{1}"

source: Cannot interpret value "{0}" as {1}
cs: Nemohu interpretovat hodnotu "{0}" jako {1}

source: Cannot return value for this instance of T1orT2 because it contains neither value1 nor value2.
cs: Nemohu vrátit hodnotu této instance T1orT2, protože neobsahuje ani hodnotu1 ani hodnotu2.

source: This T1orT2 cannot be converted to {0} because it doesn't contain value of {1}
cs: Tento T1orT2 nemůže být zkonvertován na {0} protože neobsahuje hodnotu {1}

source: Value of ObjeValue property must be either of type T1 or of type T1
cs: Hosnota vlastnosti ObjectValue musí být buď typu T1 nebo T2

source: Cannot add node that have parent already set
cs: Nemohu přidat uzel, který již má rodiče

source: Attempt to create cyclic tree
cs: Pokus o vytvožení cyklického stromu

source: Cannot add null node into tree
cs: Nemohu přidat nulový uzel do stromu

source: Cannot put null node into tree
cs: Nemohu vložit nullový uzel do stromu

source: Cannot assign node that gave parent already set
cs: Nemohu přiřadit uzel, který již má nastaveného rodiče

source: Cannot adopt null
cs: Nemohu adoprovat null

source: Only value s of type {0} can be edited by {0}
cs: Jen hodnoty typu {0} mohou být editovaány pomocí {0}

source: JPEG file doesn't start with correct SOI marker
cs: Soubor JPEG nezačíná korektní značkou SOI

source: Given marker's code doesn't start with FFh
cs: Kód dané značky nezačíná FFh

source: Stream to read JPEG from must be able to seek and read
cs: Proud, z něhož má být načten JPEG, musí podporovat změnu pozice a čtení

source: Unknown image extension, image will not be saved.
cs: Neznámá přípona obrázku, obrázek nebude uložen.

source: EOI not found
cs: EOI nenalezena

source: JPEG file doesn't end with correct EOI marker
cs: Soubor JPEG nekončí správnou značkou EOI

source: No JPEG marker found
cs: Žádná JPEG značka nenalezena

# BIMSegmentDoesnTStartWithSting8BIM
source: 8BIM segment doesn't start with sting '8BIM'
cs: Segment 8BIM nezačíná řetězcem '8BIM'

source: Reported length of 8BIM segment doesn'f fit into base stream
cs: Oznámená délka 8BIM segmentu se nevejde do nadřazeného proudu

source: Index must be in range defined by counf of IFDs
cs: Index musí být v rozdahu definovaném počtem IFD

source: Number of elements cannot be 0
cs: Počet prvků nesmí být 0

source: DataTypes cannot be null and must contain at least one element
cs: DataTypes nesmí být bull a musí obsahovat alespoň jeden element

source: Cannot change number of components of this record
cs: Nelze změni počet položek tohoto záznamu

source: Value of incompatible type passed to ASCII record
cs: Hodnota nekompatibilního typu vkládána do ASCII záznamu

source: Value of incompatible type passed to Exif record
cs: Hodnota nekompatibilního typu vkládána do Exif záznamu

source: Cannot read tag data from stream
cs: Nemohu přečíst data tagu z proudu

source: Unknown byte order mark
cs: Neznámá značka pořadí bytů

source: Invalid value for byte order test at Exif header
cs: Neplatná hodnota testu pořadí bytů v hlavičce Exif

source: Unexpected character {0}
cs: Neočekávaný znak {0}

# SlashExpected
source: / expected
cs: Očekáváno /

source: DataSets longer than 32767B are not supported
cs: DataSety delší než 32767B nesjou podporovány

source: IPTC DataSets longer that 32767 bytes are not supported
cs: IPTC DataSety delší než 32767 bytů nejsou podporovány

source: DataSetNumber must be less than or equal to 9
cs: DataSetNumber musí být menší nebo rovno 9

source: This instance is locked
cs: Tato instance je zamčena

source: Record must be from 0 to 9
cs: Číslo záznamu musí být od 0 do 9

source: Given type is not enum
cs: Daný typ není výčet

source: Cannot set Fixed to True when Length is 0
cs: Nelze nastavit Fixed na True, když Lenght je 0

source: Cannot set Length to 0 when Fixed is true
cs: Nelze nastavit Lenght na 0, když Fixed je True

source: Tag marker must be 1Ch
cs: Značka tagu musí být 1Ch

source: Extended-size tags are not supported
cs: Tagy rozšířené délky nesjou podporovány

source: Bytes cannot be 0
cs: Bytes nesmí být 0

source: Len cannot be 0 when Fixed is true
cs: Lan nesmí být 0, když Fixed je True

# CannotBeNegative
source: {0} cannot be negative
cs: {0} nemůže být záporné

source: Item {0} contains non-graphic character
cs: Položka {0} obsahuje negrafický znak

source: String "{0}" canot be stored without violating length and/or fixed constraint
cs: Řetězec "{0}" nelze uloži bez porušení omezení délky a/nebo fixní délky

source: Item {0} contains non-graphic-non-space character
cs: Položka {0} obsahuje negrafický, nemezerový znak

source: Item {0} contains non-graphic-non-space-non-cr-non-lf character
cs: Položka {0} obsahuje negrafický, nemezerový, ne-cr, ne-lf znak

source: Invalid bitmap. Number of bits in bitmap must be multiplication of 460
cs: Neplatná bitmapa. Počet bitů bitmapy musí být náuspobek 460

source: Bitmap width must be 460px
cs: Šířka bitmapy musí být 460px

source: Bitmap violates lenght constraint. Image size must be 460×{0}px
cs: Bitmapa porušuje omezení délky. Velikost obrázku musí být 460×{0}px

source: Unknown base type of enum
cs: Neznámý rodičovský typ výčtu

source: Length of data stored under this tag is different from 8 which is necessary for datatype CCYYMMDD
cs: Délka dat uložených v tomto tagu je jiná než 8, což je nutné pro datový typ CCYYMMDD

source: Length of data stored under this tag is different then 11 which is necessary for datatype HHMMSS_HHMM
cs: Délka dat uložených v tomot tagu je jiná než 11, což je nutné pro datový typ HHMMSS_HHMM

source: Stored time does not contain valid character on time zone offset sign position
cs: Uložený čas neobsahuje platný znak na pozici znaménka offsetu časového pásma

source: When Fixed is True Len cannot be 0
cs: Když Fixed je True Len nemůže být 0

source: Lenght constraint violation.
cs: Porušení omezení délky.

source: Item {0} contains non-alpha character
cs: Položka {0} obsahuje nepísmenný znak

source: EnumType of items passed to StringEnum_Value must be same as that in the Type parameter
cs: EnumType položek předaných do StringEnum_Value musí být stejný jako ten v patametrue Typ

source: This enumeration does not allow values that are not member of it
cs: Tento výčet nepodporuje hodnoty, které nejsou jeho členy.

source: Stored value has invalid lenght
cs: Uložená hodnota má neplatnou délku

source: Serialized value has not length 2 bytes.
cs: Serializovaná hodnota nemá délku 2 byty.

source: Stored item lenght must be {0}
cs: Délka uložené položky musí být {0}

source: Time must be non-negative and less then 1 day
cs: Čas musí být nezáporný a kratší než 1 den

source: SubjectReferenceNumber must be member of either SubjectReferenceNumbers, SubjectMatterNumbers or EconomySubjectDetail
cs: SubjectReferenceNumber musí být členem SubjectReferenceNumbers, SubjectMatterNumbers nebo EconomySubjectDetail

source: Lenght of SubjectName must fit into 64
cs: Délka SubjectName se musí vejít do 64

source: SubjectName can contain only graphic characters except :, ? and *
cs: SubjectName smí obsahovat jen grafické znaky mimo :, ? a *

source: Lenght of SubjectReference must fit into 64
cs: Délka SubjectReference su musí vejít do 64

# CanContainOnlyGraphicCharactersExceptAnd
source: {0} can contain only graphic characters except :, ? and *
cs: {0} smí obsahovat jen grafické znaky mimo :, ? a *

source: Lenght of {0} must fit into {1}
cs: Délka {0} se musí vejít do {1}

# MustContainExactly1Parts
source: {0} must contain exactly {1} parts
cs: {0} musí obsahovat přesně {1} položek

source: Length of serialized {0} is not within range {1}÷{2} bytes
cs: Délka serializovaného {0} není v rozmezí {1}÷{2} bytů

source: Lenght of serialized {0} differs from {1} bytes
cs: Délka serializovaného {0} se liší od {1} bytů

source: Lenght of serialized name exceeds {0} bytes
cs: Délka serializovaného jména přesahuje {0} bytů

source: Only graphic characters are allowed in {0}
cs: Jen grafické znaky jsou povoleny v {0}

# CannotContainCharactersAnd
source: {0} cannot contain characters *, /, ? and :
cs: {0} nesmí obsahovat znaky *, /, ? a :

# MustBeStringWithLengthFrom1To2Characters
source: {0} must be string with length from {1} to {2} characters
cs: {0} musí být řetězec délky od {1} do {2} znaků

source: The lenght of {0} exceeds limit
cs: Délka {0} přesahuje limit

# TextMustBeEncodeableByASCII
source: {0} text must be encodeable by ASCII
cs: Text {0} musí být zakódovatelný v ASCII

# CannotBeNullOrEmpty
source: {0} cannot be null or empty
cs: {0} nesmí být null ani prázdná

source: Cannot remove last item from {0}
cs: Nemohu odebrat poslední položku z {0}

# CannotBeCleared
source: {0} cannot be cleared
cs: {0} nemůže být bymazána

# CanConsistOnlyOfGraphicCharacters
source: {0} can consist only of graphic characters
cs: {0} smí obsahovat jen grafické znaky

# ComponentCannotBeAnEmptyString
source: {0} component cannot be an empty string
cs: Komponenta {0} nesmí být prázdný řetězec

# ComponentMustBeEncodeableByASCII
source: {0} component must be encodeable by ASCII
cs: Komponenta {0} musí být zakódovatelná v ASCII

source: Length of ODE and IPR together with separators must wit into 61
cs: Délka ODE a IPR dohromady s oddělovači se musí vejít do 61

# HasToManyDigits
source: {0} has to many digits
cs: {0} má moc číslic

source: Type is specified neither via property nor in value
cs: Typ není určen ani vlastností ani hodnotou

# MustBeFromRange12Or3IfUnknown
source: {0} must be from range {1}÷{2} or {3} if unknown
cs: {0} musí být z rozsahu {1}÷{2} nebo {3} pokud je neznámý

# MustBeLessThenOrEqualTo1
source: {0} must be less then or equal to {1}
cs: {0} musí být menší nebo rovno {1}

source: Cannot convert string "{0}" to {1}
cs: Nemohu pževést řetězec "{0}" na {1}

# MustBePositiveAndLessThan1H0MmSs
source: {0} must be positive and less than {1:h(0):mm:ss}
cs: {0} musí být kladná a menčí než {1:h(0):mm:ss}

# MustBeInWholeMinutes
source: {0} must be in whole minutes
cs: {0} musí být v celých minutách

# MustBeWithinRange01
source: {2} must be within range {0}÷{1}
cs: {2} musí být z rozsahu {0}÷{1}

# CannotBeInterpretedAsMemberOf1
source: {0} cannot be interpreted as member of {1}
cs: {0} nemůže být interpretován jako člen {1}

# CannotBeInterpretedAs1
source: {0} cannot be interpreted as {1}
cs: {0} nemůže být interpretováno jako {1}

source: Number of components of {0} must be from {1} to {2}
cs: Počet komponente {0} musí být od {1} do {2}

# MustBeMemberOfEnumeration1
source: {0} must be member of enumeration {1}
cs: {0} musí být členem výčtu {1}

# CanContainOnlyASCIIEncodableGraphicCharactersAndSpaces
source: {0} can contain only ASCII-encodable graphic characters and spaces
cs: {0} může obsahovat jen grafické znaky kódovatelné v ACSCII a mezery

# CannotBeConvertedTo1
source: '{0}' cannot be converted to {1}
cs: '{0}' nemůže být konvertováno na {1}

# CannotBeChanged
source: {0} cannot be changed
cs: {0} nelze změnit

# CannotBeSetToFalse
source: {0} cannot be set to false
cs: {0} nelze nastavit na False

source: Value of incompatible type is being set
cs: Nastavování hodnoty nekompatibilního typu

source: Each group must have at least {0} tags
cs: Každá skupina musí mít alespoň {0} tagů

# MustContainAtLeast1Items
source: {0} must contain at least {1} items
cs: {0} musí obsahovat alespoň {1} položek

source: Only 1,2,4 and 8-bytes integers can be read via {0}
cs: Jen 1-, 2-, 4- a 8-bytové integery mohou být čteny pomocí {0}

source: Number {0} cannot be stored in {1} bytes
cs: Číslo {0} nelze uložit v {1} bytech

# CannotBe1When2Is3
source: {0} cannot be {1} when {2} is {3}
cs: {0} nemůže být {1}, když {2} je {3}

source: ISO 639-1 code must contain exactly 2 lowercase latin letters.
cs: Kód ISO 693-1 musí obsahovat pžesně 2 písmena malé latinské abecedy.

source: ISO 639-2 code must contain exactly 3 lowercase latin letters.
cs: Kód ISO 639-2 musí obsahobat přesně 3 píspena malé latinské abecedy.

# CannotBeNullOrAnEmptyString
source: {0} cannot be null or an empty string
cs: {0} nesmí být null nebo prázdný řetězec

source: ISO 639-2 duplicate code must contain exactly 3 lowercase latin letters.
cs: Duplicitní kód ISO 639-2 musí obsahovat přesně 3 malá latinská písmena.

source: Code is not valid ISO 639 language code
cs: Kód není platným kódem jakzyka ISO 639

source: Cannot change state from {0} to {1}
cs: Nemohu změnit stav z {0} na {1}

source: This {0} cannot be converted to {1} because it doesn't contain {1}.
cs: Tento {0} nemůže být převeden na {1} protože neobsahuje {1}.

source: Version component must be greater than or equal to zero
cs: Komponenta verze musí být vetší než nebo rovna nule

source: Stream must support reading and seeking
cs: Proud musí podporovat čtení a změnu pozice

source: Size of constrained stream must fit into base stream.
cs: Velikost omezeného proudu se musí vejít do rodičovského proudu.

# SupportsNeitherWritingNorSeeking
source: {0} supports neither writing nor seeking
cs: {0} nepodporuje ani zápis ani změnu polohy

# DoesnTSupportWriting
source: {0} doesn't support writing
cs: {0} nepodporuje zápis

source: The enumeration has not started yet or has already finished.
cs: Enumerace ještě nezačala nebo již skončila.

source: Property {0} has already been set and it cannot be changed
cs: Vlastnost {0} již byla nastavena a nemůže již být změněna

source: Path cannot be based on null string
cs: Cestu nelze založit na nullovém řetězci

source: Path cannot be based on an empty string or string containing only whitespaces
cs: Cestu nezle založit na prázdném řetezci nebo řetězci skládajícím se jen z bílých znaků

source: Path string contains invalid character '{0}'
cs: řetězec cesty obsahuje nepletný znak '{0}'

# ShouldBeGreaterThanZero
source: {0} should be greater than zero
cs: {0} by mělo být vyšší než nula

source: The path's depth is not enough to remove {0} levels
cs: Hloubka cesty není dostatečná pro odstranění {0} úrovní

source: Source file or directory not found
cs: Zdrojový soubor nebo složka neexiustují

# MustBePositive
source: {0} must be positive
cs: {0} musí být kladné

# MustBeWithinRange12
source: {0} must be within range <{1}; {2})
cs: {0} musí být z rozsahu <{1}; {2})

# MustContainAtLeastOneItem
source: {0} must contain at least one item.
cs: {0} musí obsahovat alespoň jednu položku.

source: There is not enought results.
cs: Nedostatek výsledků.

source: No condition was true.
cs: Žádná podmínka nebyla True.

source: Number of bit in {0} must be less that {1}
cs: Počet bitů v {0} musí být nižší než {1}

# WasInfinity
source: {0} was infinity
cs: {0} bylo nekonečno

# WasNaN
source: {0} was NaN
cs: {0} bylo NaN

source: Syntax error in format string. Unexpected end of format string in inner format specification at {0}.
cs: Syntaktická chyba ve formátovacím řetezci. Neočekávaný konec formátovacího řetězce ve specifikaci vnitřního formátu na pozici {0}.

source: Syntax error in format string. 'D' must be followed with '(' at {0}.
cs: Syntaktická cyhab ve formátovacím řetezci. 'D' musí být následováno '(' na pozici {0}.

source: Syntax error in format string. '[' must be followed with 'd' or 'D' at {0}.
cs: Syntaktická chyba ve formátovacím řezezci. '[' musí být následováno 'd' nebo 'D' na pozici {0}.

source: Syntax error in formast string. ']' expected at {0}.
cs: Syntaktická chyba ve formátovacím řetězci. ']' očekáváno na pozici {0}.

source: Syntax error in format string. 'H' must be followed with '(' at {0}.
cs: Syntaktická chyba ve formátovacím řetězci. 'H' musí být následováno '(' na pozici {0}.

source: Syntax error in format string. 'M' must be followed with '(' at {0}.
cs: Syntaktická chyba ve formátovacím řetězci. 'M' musí být následováno '(' na pozici {0}.

source: Syntax error in format string. 'S' must be followed with '(' at {0}.
cs: Syntaktická chyba ve formátovacím řetězci. 'S' musí být následováno '(' na pozici {0}.

source: Syntax error in format string. 'L' must be followed with '(' at {0}.
cs: Syntaktická chyba ve formátovacím řetězci. 'L' musí být následováno '(' na pozici {0}.

source: Syntax error in format string. 'T' must be followed by '(' at {0}.
cs: Syntaktická chyba ve formátovacím řetězci. 'T' musí být následováno '(' na pozici {0}.

source: Syntax error in format string. Unexpected end of format string in quoted string at {0}.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný konec formátovacího řetežce v uvozovkovaném řetězci na pozici {0}.

source: Syntax error in format string. Unexpected end of format string in condition left side {0}.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný konec formátovacího řetežce v levé straně podmínky na pozici {0}.

source: Syntax error in format string. Unexpected character in format string (condition left side) {0} at {1}.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný znak ve formátovacím řetězce (levá strana podmínky) {0} na pozici {1}.

source: Syntax error in format string. Unexpected end of format string in condition left side absolute value {0}.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný konec formátovacího řetězce vlevé straně podmínky - absolutní hodnota na pozic {0}.

source: Syntax error in format string. Unexpected character in format string (condition left side absolute value) {0} at {1}.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný znak ve formátovacím řetezci (podmínka levé strany - basolutní hodnota) {0} na pozici {1}.

source: Syntax error in format string. Unexpected end of format string in condition left side absolute value at {0}. Expected '{1}'.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný konec formátovacího řetezce v levé straně podmínky - absolutní hodnota na pozici {0}. Očekáváno '{1}'.

source: Syntax error in format string. Unexpected character '{0}' in condition left side absolute value at {1}. Expected '{2}'.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný znka '{0}' v levé straně podmínky - absolutní hodnota na pozici {1}. Očekáváno '{2}'.

source: Syntax error in format string. Unexpected end of format string in condition at {0}. Expected comparison operator.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný konec formátovacího řetezce v podmínce na pozici {0}. Očekáván operátor porovnání.

source: Syntax error in format string. Unexpected character '{0}' in condition at {1}. Expected comparison operator.
cs: Syntaktická chyba ve formátovacím řetězci. Neočekávaný znak '{0}' v podmínce na pozici {1}. Očekáván operátor porovnání.
