Repository: DzonnyDZ/Tools
Catalog: Projects/Metanol2/Database/Synchronization/3 - SynchronizeStep.*.resx
Languages: cs

# cmdCancel.Text
source: &Cancel
cs: S&torno

# lblName.Text
source: Synchronization
cs: Synchronizace

# lblI.Text
source: Performs synchronization of image metadate with database.
cs: Provede synchronizaci obrazových metadat s databází.

# cmdStart.Text
source: &Start
cs: &Začít

# lblMode.Text
source: Mode
cs: Režim

# lblOnConflict.Text
source: On conflict
cs: Při konfiliktu

# lblOnDuplicitName.Text
source: On duplicit name in different folders
cs: Při duplicitních názvech v různých složkách

# optAskOverwrite.Text
source: &Ask
cs: &Dotázat se

# optOverwriteDatabase.Text
source: Always overwrite &database
cs: Vždy přepsat &databázi

# optOverwriteFile.Text
source: Always overwrite &file
cs: Vždy přepsat &soubor

# optRelocateAsk.Text
source: As&k
cs: Dotáz&at se

# optRelocateIgnore.Text
source: &Ignore
cs: &Ignorovat

# optRelocate.Text
source: &Relocate in database
cs: &Přemístit v databázi

# optModeSynchronizeAdd.Text
source: S&ynchronize and add
cs: S&ynchronizovat a přidat

# optModeSynchronizeExisting.Text
source: Synchronize e&xisting only
cs: Synchronizovat jen e&xistující

# optModeAdd.Text
source: Only add &new
cs: Jen přidat &nové
