Repository: DzonnyDZ/Tools
Catalog: Tools.Metadata/My Project/Resources.*.resx
Languages: cs

# d_FullPath
source: Full path to file
cs: Plná cesta k souboru

# d_DirectoryName
source: Path to directory file is saved in
cs: Cesta ke složce, kde js soubor uložen

# d_FileName
source: Name of the file with extension
cs: Název souboru bez přípony

# d_Size
source: Size of the file in bytes
cs: Velikost souboru v bytech

# d_CreationTime
source: Date and time when the file was created
cs: Datum a čas, kdy byl soubor vytvořen

# d_CreationTimeUtc
source: Date and time when the file was created coordibates in universal time (UTC)
cs: Datum a čas, kdy byl soubor vytvořen, v koordinátech UTC

# d_LastWriteTime
source: Date and time when the file was last written to
cs: Datum a čas, kdy bylo do souboru naposledy zapsáno

# d_LastWriteTimeUtc
source: Date and time coordinated in universal time (UTC) the file was last written to
cs: Datum a čas, kdy bylo do souboru naposledy zapsáno, v koordinátech UTC

# d_LastAccessTime
source: Date and time the file was last accessed
cs: Datum a čas, kdy bylo k souboru naposledy přistoupeno

# d_LastAccessTimeUtc
source: Date and time coordinated in universal time (UTC) the file was last accesed
cs: Datum a čas, kdy bylo k souboru naposledy přistoupeno, v koordinátech UTC

# d_Extension
source: Extension part of file name. That's part after last dot.
cs: Část jména souboru představující příponu, tj. část za poslední tečkou.

# d_NameWithoutExtension
source: File name without extension, that's exluding last dot and text after it.
cs: Název souboru bez přípony, tj, bez části za poslední tečkou vč. té tečky.

# d_IsReadOnly
source: Indicates if file is read only
cs: Indikuje, zda je soubor jen ke čtení

# d_IsSystem
source: Indicates if file is system file
cs: Indikuje, zda je soubor systémový

# d_IsHidden
source: Indicates if file is hidden
cs: Indikuje, zda je soubor skrytý

# d_IsEncrypted
source: Indicates if file is encrypted
cs: Indikuje, že je soubor zašifrován

# d_Attributes
source: All file attributes OR-ed
cs: Všechny atributy souboru zaORované

# n_FullPath
source: Full path
cs: Plná cesta

# n_DirectoryName
source: Directory
cs: Složka

# n_FileName
source: Name
cs: Název

# n_Size
source: Size
cs: Velikost

# n_CreationTime
source: Creation time
cs: Datum vytvoření

# n_CreationTimeUtc
source: Creation time UTC
cs: Datum vytvoření UTC

# n_LastWriteTime
source: Last change time
cs: Datum změny

# n_LastWriteTimeUtc
source: Last change time UTC
cs: Datum změny UTC

# n_LastAccessTime
source: Last access time
cs: Datum posledního přístupu

# n_LastAccessTimeUtc
source: Last access time UTC
cs: Datum posledního přístupu UTC

# n_Extension
source: Extension
cs: Přípona

# n_NameWithoutExtension
source: Name without extension
cs: Název bez přípony

# n_IsReadOnly
source: Read only
cs: Jen ke čtení

# n_IsSystem
source: System
cs: Systémový

# n_IsHidden
source: Hidden
cs: Skrytý

# n_IsEncrypted
source: Encrypted
cs: Šifrovaný

# n_Attributes
source: Attributes
cs: Atributy
