Repository: DzonnyDZ/Tools
Catalog: DevelopmentTools/ResXFileCodeGeneratorEx/Resources.*.resx
Languages: cs

# MismatchedResourceName
source: When passing ResXDataNodes as the IDictionary values to StronglyTypedResourceBuilderEx.Create, the keys must match the corresponding values for ResXDataNode.Name. Key name: '{0}', ResXDataNode.Name: '{1}'.
cs: Při předávání ResXDataNodů jako hodnot v IDictionary do StronglyTypedResourceBuilderEx.Create se musí klíče shodovat s odpovídajícími hodnotami pro ResXDataNode.Name. Název klíče: '{0}', ResXDataNode.Name: '{1}'.

# StringTruncatedComment
source: {0} [rest of string was truncated]";
cs: {0} [zbytek řetězce byl oříznut]";

# StringPropertyComment
source: Looks up a localized string similar to '{0}'.
cs: Najde lokalizivaný řetězec podobný '{0}'.

# NonStringPropertyComment
source: Looks up a resource '{0}'.
cs: Najde řetězec '{0}'.

# FormatMethodComment
source: Formats a localized string similar to '{0}'.
cs: Formátuje lokalizovaný řetězec podobný '{0}'.

# FormatStubMethodComment
source: The stub formatting method returning the {0} property value.
cs: Pahýl formátovací metody vracející hodnotu vlastnosti {0}.

# ClassComments1Format
source: This class was auto-generated by the StronglyTypedResourceBuilderEx class via the {0} custom tool.
cs: Tato třída byla automaticky vygenerována pomocí třídy StronglyTypedResourceVuildeEx přes custom tool {0}.

# ClassComments2Format
source: To add or remove a member, edit your .ResX file then rerun the {0} custom tool or rebuild your VS.NET project.
cs: Pro přidání nebo odebrání člena editujte váš .resx soubor a pak spusťte custom tool {0} nebo přebuildujte váš projek ve VS.NET.

# ResMgrPropertyComment
source: Returns the cached ResourceManager instance used by this class.
cs: Vrací nacacheovanou instanci ResourceManageru používanou touto třídou.

# ParamCommentStatement
source: <param name="arg{0}">An object ({0}) to format.</param>
cs: <param name="arg{0}">Objekt ({0}) pro formátování.</param>

# MethodReturnValueComment
source: <returns>A copy of format string in which the format items have been replaced by the String equivalent of the corresponding instances of Object in arguments.</returns>
cs: <returns>Kopie ofrmátovacího řetězce, kde formátovací položky byly nahrazeny řetězcovými ekvivalenty instancí objektů předaných do parametrů.</returns>

# StubMethodReturnValueComment
source: <returns>The {0} property value.</returns>
cs: <returns>Hodnota vlastnosti {0}.</returns>

# CulturePropertyComment1
source: Overrides the current thread's CurrentUICulture property for all
cs: Přepisuje hodnoty vlastnosti CurrentUICulture aktuálního vlákna pro všechna

# CulturePropertyComment2
source: resource lookups using this strongly typed resource class.
cs: vyhledávání resourců pomocí této silně typové třídy.

# InvalidIdentifier
source: Identifier '{0}' is not valid.
cs: Identifikátor '{0}' není platný.

# ClassDocComment
source: A strongly-typed resource class, for looking up localized strings, formatting them, etc.
cs: Třída silně typovaných zdrojů pro vyhledávání, formátování atd. lokalizačních řetězců.

# CannotCreatePropertyForResource
source: Cannot create property for resource named '{0}'.
cs: Nemohu vytvořit vlastnost pro zdroj nazvaný '{0}'.

# ErrorInFormatPropertyForResource
source: {0} Property name: {1}.
cs: {0} Název vlastnosti: {1}.

# CannotCreateFormatMethod
source: Cannot create the format method named '{0}' for the resource key '{1}'.
cs: Nemohu vytvořit formátovací metodu s názvem '{0}' pro klíč zdrojů '{1}'.

# InternalSyncObjectPropertyComment
source: Thread safe lock object used by this class.
cs: Vláknově bezpešný zamykací objekt používaný touto třídou.
