Repository: DzonnyDZ/Tools
Catalog: Tools.Windows/Windows/WPF/Converters/ConverterResources.*.resx
Languages: cs

# ex_UnsupportedDataType
source: Unsupported data type {0}
cs: Nepodporovaný datový typ {0}

# ex_ConvertsOnlyToBool
source: {0} converts only to boolean.
cs: {0} převádí jen na boolean.

# ex_CanConvertBackOnlyFromFalse
source: {0} can convert back only from False.
cs: {0} může převést zpět jen z false.

# ex_CannotConvertBack
source: {0} cannot convert back.
cs: {0} namůže převádět zpět.

# ex_ConvertOnlyFromNumericAndColors
source: {0} can convert only from numeric and color types.
cs: {0} může převádět jen z numerických typů a typů reprezentujících barvy.

# ex_ValueMustBeSetPriorCalling
source: Value of the {0} property mus be set prior to calling {1}
cs: Hodnota vlastnosti {0} musí být nastavena před voláním {1}

# ex_ConverterCanConvertOnlyFromTo
source: {0} can convert only from {1} to {2}.
cs: {0} může převádět jen z {1} do {2}.

# ex_ConverterCanConvertBackOnlyFromTo
source: {0} can convert back only from {1} to {2}.
cs: {0} může převádět zpět jen z {1} do {2}.

# ex_ConverterCannotConvertValueBack
source: {0} cannot convert back value {1}.
cs: {0} nemůže převést zpět hodnotu {1}.

# ex_IsNotAssignableFrom
source: {0} is not assignable from {1}
cs: {0} není přiřaditelné z {1}

# ex_IsAssignableFromNeither
source: {0} is assignable from neither {1} nor {2}
cs: {0} není přiřaditelné z {1} ani z {2}

# ex_FunctionForForwardConversionHaveNotBeenSet
source: Function for forward conversion have not been set.
cs: Funkce pro dopředný převod nebyla nastavena.

# ex_FunctionForBackwardConversionHasNotBeenSet
source: Function for backward conversion has not been set.
cs: Fonkce pro zpětný převod nebyla nastavena.

# ex_IsNull
source: {0} is null.
cs: {0} je null.

# ex_CanConvertBackOnlyTo
source: {0} can convert back only to {1}.
cs: {0} může konvertovat zpět jen na {1}.

# ex_CanConvertBackOnlyFromColors
source: {0} can convert back only from {1} and {2}.
cs: {0} může convertovat zpět jen z {1} a {2}

# ex_CanConvertOnlyTo
source: {0} can convert only to {1}
cs: {0} může konvertovat jen na {1}

# ex_IntermediateValueUndefined
source: Converter parameter does not contain definition for intermediate value.
cs: Parametr konvertéru neobsahuje definici pro mezistav.

# ex_IntermediateEmpty
source: Converter parameter for intermediate value is empty.
cs: Parametr konvertéru pro mezistav je prázdný.

# ex_CheckedUndefined
source: Converter parameter does not contain definition for checked value.
cs: Parametr konvertéru neobsahuje definici pro zaškrtnutý stav.

# ex_CheckedEmpty
source: Converter parameter for checked value is empty.
cs: Parametr konvertéru pro zaškrtnutý stav je prázdný.

# ex_UncheckedUndefined
source: Converter parameter does not contain definition for unchecked value.
cs: Parametr konvertétu neobsahuje definic pro odškrtnutý stav.

# ex_UncheckedEmpty
source: Converter parameter for unchecked value is empty.
cs: Parametr konvertéru pro odškrtnutý stav je prázdný.

# ex_ConverterSupportsOnlyTargetTypes_2AndOneGeneric
source: {0} supports only target types {0} and {1} and {2} of {1}
cs: {0} podporuje jen cílové type {0} a {1} a {2}[{1}]

# ex_ConverterCanConvertBackOnlyTo_1And1Generic
source: {0} can convert back only to {1} and {2} of {1}
cs: {0} může konvertovat zpět jen do {1} a {2}[{1}]

# ex_CharacterNotBoolean
source: Character '{0}' does not represent known boolean value
cs: Znak '{0}' nereprezentuje známou logickou hodnotu

# ex_ConverterCanConvertOnlyTo_2
source: {0} can convert only to {1} and {2}
cs: {0} může konvertovat jen do {1} a {2}

# ex_ConverterCanConvertOnlyFrom_2
source: {0} can convert only from {1} and {2}
cs: {0} může konvertovat jen z {1} a {2}

# ex_ConverterAcceptsValuesOfType_3
source: {0} accepts values of type {1}, {2} and {3}
cs: {0} akceptuje jen hodnoty typů {1}, {2} a {3}

# ex_ConverterCanConvertOnlyTo_3
source: {0} can convert only to {1}, {2} and {3}
cs: {0} může konvertovat jen do {1}, {2} a {3}
