Repository: DzonnyDZ/Tools
Catalog: Tools.Windows/Windows/Forms/Composite controls/ObjectBrowser.*.resx
Languages: cs

# cohItem.Text
source: Item
cs: Položka

# tmiShowCTors.Text
source: Constructors
cs: Konstruktory

# tmiShowEvents.Text
source: Events
cs: Události

# tmiShowFields.Text
source: Fields
cs: Proměnné

# tmiShowGenericArguments.Text
source: Generic arguments
cs: Generické argumenty

# tmiShowGlobalMembers.Text
source: Global members
cs: Globální členy

# tmiShowInheritedMembers.Text
source: Inherited members
cs: Zděděné členy

# tmiShowInitializers.Text
source: Initializers
cs: Inicializátory

# tmiShowInstanceMembers.Text
source: Instance members
cs: Instanční členy

# tmiShowInternalMembers.Text
source: Internal members
cs: Interní členy

# tmiShowMethods.Text
source: Methods
cs: Metody

# tmiShowNestedTypes.Text
source: Nested types
cs: Vnořené členy

# tmiShowPrivateMembers.Text
source: Private members
cs: Privátní členy

# tmiShowProperties.Text
source: Properties
cs: Vlastnosti

# tmiShowProtectedMembers.Text
source: Protected members
cs: Chráněné členy

# tmiShowSpecialMembers.Text
source: Special members
cs: Speciální členy

# tmiShowReferences.Text
source: References
cs: Reference

# tmiShowBaseTypes.Text
source: Base types
cs: Bázové typy

# tmiShowStaticMembers.Text
source: Static memebers
cs: Statické členy

# tmiShowFlatNamespaces.Text
source: Flat namespaces
cs: Ploché jmenné prostory

# tdbShow.Text
source: Show
cs: Zobrazit

# tsbBack.Text
source: Back
cs: Zpět

# tsbForward.Text
source: Forward
cs: Vpřed
