Repository: DzonnyDZ/Tools
Catalog: DevelopmentTools/XsdGenerator/Resources.*.resx
Languages: cs

source: XSD Classes Generator
cs: XSD Generátor tříd

# ex_AssemblyTooBig
source: Assembly too big. Operation not supported.
cs: Sestavení je příliš velké. Operace není podporována.

# ex_DebugSymbolsToooBig
source: Debug symbols too big. Operation not supported.
cs: Ladicí symboly sjou příliš velké. Operace není podporována.

# err_CouldNotGenerateCode
source: #error Couldn't generate code! /* {0} */
cs: #chyba Nemohu generovat kód! /* {0} */

# ex_InvalidExtensionType
source: Invalid extension type '{0}'.
cs: Neplatný typ rozšíření '{0}'.

# Summary_misc
source: <summary>Misc items</summary>
cs: <summary>Různé položky</summary>

# Summary_misc_types
source: <summary>Array of all types generated by custom tool</summary>
cs: <summary>Pole všech typů generovaných vlastním nástrojem</summary>

# Summary_OnChanging
source: <summary>Raises the <see cref='{0}Changing'/> event</summary> <param name='e'>Event erguments</param>
cs: <summary>Vyvolává událost <see cref='{0}Changing'/></summary> <param name='e'>Argumenty udállosti</param>

# Summary_Changing
source: <summary>Raised when value of property {0} is about to change.</summary> <remarks>Throw exception to avoid this change. The exception will be passed to source of change.</remarks>
cs: <summary>Vyvolána, pokud se hodnota vlastnosti {0} chystá změnit.</summary> <remarks>Abyste předešli změně, vyvolejte výjimku. Výjimka je předána zdroji změny.</remarks>

# Summary_PropertyChanging
source: <summary>Occurs when a property value is changing.</summary>
cs: <summary>Nastávaá, když se hodnota vlastnosti měmní.</summary>

# Summary_OnPropertyChanging
source: <summary>Raises the <see cref='PropertyChanging'/> event</summary>
cs: <summary>Vyvolává událost <see cref='PropertyChanging'/></summary>

# Param_OnPropertyChanging_e
source: <param name='e'>Event arguments</summary>
cs: <param name='e'>Argumenty události</summary>

# ex_UknnownNullSerializationOption
source: Uknnown null serialization option "{0}". Expected Empty or Null.
cs: Neznámá serializační volba pro null "{0}". Očekáváno "Empty" nebo "Null".

# ex_TypeNotFound
source: Type {0} not found.
cs: Typ {0} nenalezen.

# ex_UknnownDateSerializationKind
source: Uknnown date serialization kind "{0}". Expected Date or DateTime.
cs: Neznámý typ serializace datumů "{0}". Očekáváno "date" nebo "DateTime".

# ex_PropertyNotFound
source: Property {0} not found.
cs: Vlastnost {0} nenalezena.

# ex_FieldNotFound
source: Field {0} not found.
cs: Proměnná (field) {0} nenalezena.

# Registered
source: Registered {0}
cs: Registrováno {0}

# Unregistered
source: Unregistered {0}
cs: Odregistrováno {0}
