Repository: DzonnyDZ/Tools
Catalog: DevelopmentTools/AssemblyPostprocessor/My Project/Resources.*.resx
Languages: cs

# ex_PropertyOrFieldNotFound
source: Neither field nor property named '{0}' was found
cs: Ani vlastnost ani proměnná s názvem '{0}' nebyla nalezena

# Usage
source: Usage: {0} assembly1 assembly2 ...
cs: Použití: {0} assembly1 assembly2 ...

# msg_ItemError
source: Error {0} occured for item {1}: {2}
cs: Chyba {0} nastala pro položku {1}: {2}

# msg_InnerException
source: Inner exception:
cs: Vnitřní výjimka:

# msg_Apply
source: Apply {0}
cs: Aplikuji {0}

# wrn_AttributeAppliedOnUnsupportedItem
source: WARNING: {0} applied on unsupported item {1}
cs: VAROVÁNÍ: {0} applikován na nepodporované položce {1}

# msg_ProcessingAssembly
source: Processing assembly ...
cs: Zpracovávám sestavení ...

# wrn_TypeNotFound
source: WARNING: Type {0} not found
cs: VAROVÁNÍ: Typ {0} nenalezen

# GenParsNotSupported
source: Generic parameters on {0} are not supported
cs: Generické parametry na {0} nesjou podporovány

# MessageProcessorTypeError
source: Message processor must derive from {0}
cs: Objekt pro zpracování zpráv musí dědit of {0}

# TaskReceiverTypeError
source: Type of Receiver must be {0}
cs: Typ receiveru musí být {0}

# ex_UnsupportedGParOwner
source: Equality comparison of types representing generic arguments of something else then type and method is not supported
cs: Porovnání shody typů, které představují generické argumenty něčeho jiného než typů a method, není podporováno

# ex_TypeDoesNotImplement
source: {0} does not implement {1}
cs: {0} neimplementuje {1}

# ex_TypeDoesNotInherit
source: {0} does not derive from {1}
cs: {0} nedědí od {1}

# ex_StaticMethodCannotImplement
source: Static method {0} cannot implement base member
cs: Statická metoda {0} nemůže implementovat člena rodičovské třídy

# ex_CannotImplement
source: {0} cannot be implemented
cs: {0} nelze implementovat

# ex_MethodAmbiguous
source: More than one {0}.{1} method matches criteria
cs: Více jak jedna metoda {0}.{1} splňuje kritéria

# ex_PropertyAmbiguous
source: More than one {0}.{1} property matches criteria
cs: Více jak jedna {0}.{1} vlastnost splňuje kritéria

# ex_PropertyWOGetterSetter
source: Only properties with setter or getter or both are supported.
cs: Jen vlastosti s getterem, setterem nebo oběma jsou podporovány.

# ex_PropertyMixedAccessorStaticInstance
source: Only properties with all accessors instance (non-static) are supported.
cs: Jen vlastnosti jejichž všechny accessory jsou instanční jsou podporovány

# ex_PropertyExternalAccessor
source: Only properties where all methods are implemented in the same type as the property itself are supported.
cs: Jenom vlastnosti jejichž všechny accessory jsou implementovány v tom samém typu jako vlastnost sama jsou podporovány.

# ex_EventWOAddRemove
source: Only events with added or remover are supported
cs: Jen události s adderem nebo removerem jsou podporovány

# ex_EventMixedAccessorStaticInstance
source: Only events with all instance (non-static) methods are supported
cs: Jen události jejichž všechny accessory jsou instanční jsou podporovány

# ex_EventExternalAccessor
source: Only events with all accessoers declared in the same type as the event itself are supported.
cs: Jenom události jejichž všechny accessory jsou implementovány v tom samém typu jako událost sama jsou podporovány.

# ex_EventAmbiguous
source: More than one {0}.{1} event matches criteria
cs: Více jak jedna událost {0}.{1} splňuje kritéria

# ex_OnylAssemblyAndModule
source: {0} supports only assemblies and modules
cs: {0} podporuje jen sestavení a moduly

# ex_RemovalNotSupported
source: Removal of {0} is not supported
cs: Odstranění {0} není podporováno

# ex_UnsupportedGParRemoval
source: Removal of generic parameters of {0} is not supported
cs: Odstranění generických argumentů z {0} není podporováno

# Implements
source: {0} implements {1}
cs: {0} implementuje {1}

# Removed
source: {0} removed from {1}
cs: {0} odstraněno z {1}

# ex_RemoveReturnValue
source: Return value cannot be removed
cs: Návratová hodnota nemůže být odebrána

# ex_AttrIsNotSupportedOnItem
source: {0} is not supported on {1}
cs: {0} není podporováno na {1}

# msg_Rename
source: Rename {0} -> {1}
cs: Přejmenování {0} -> {1}

# msg_AddedResource
source: Added {0} resource {1} from {2}.
cs: Přídán {0} zdroj {1} z {2}.

# resource_embeded
source: embeded
cs: vestavěný

# resource_linked
source: linked
cs: linkovaný

# msg_RemoveReference
source: Remove reference {0} from {1}
cs: Odstranit referenci {0} z {1}
