Repository: DzonnyDZ/Tools
Catalog: Tools.Metadata/Resources/resx (Friend)/IPTCResources.*.resx
Languages: cs

# SubjectNumber_n
source: Subject Number
cs: Číslo subjektu

# SubjectNumber_d
source: Subject component of Subject Reference Number
cs: Část 'subjekt' z referenčního čísla subjektu

# SubjectMatterNumber_n
source: Subject Matter Number
cs: Základní číslo subjektu

# SubjectMatterNumber_d
source: Matter component of Subject Reference Number
cs: Část 'základ' referenčního čísla subjektu

# SubjectDetailNumber_n
source: Subject Detail Number
cs: Detailní číslo subjektu

# SubjectDetailNumber_d
source: Detail component of Subject Reference Number
cs: Část 'detail' referenčního čísla subjektu

# SubjectName_n
source: Subject Name
cs: Název subjektu

# SubjectName_d
source: A text representation of the Subject Number (maximum 64 octets) consisting of graphic characters plus spaces either in English, as defined in Appendix H, or in the language of the service as indicated in DataSet Language Identifier (2:135)
cs: Textová reprezentace čísla subjektu (maximálně 64 oktetů) stávající se z grafických znaků a mezer, buďto v angličtině, jak je definováno d dodatku H, nebo v jazyce služby určeném v 'identifikátor jazyka datasetu' (2:135)

# SubjectMatterName_n
source: Subject Matter Name
cs: Základní číslo subjektu

# SubjectMatterName_d
source: A text representation of the Subject Matter Number
cs: Textová reprezentace základního čísla subjektu

# SubjectDetailName_n
source: Subject Detail Name
cs: Detailní název subketu

# SubjectDetailName_d
source: A text representation of the Subject Detail Number
cs: Text reprezentující detailní číslo subjektu

# IPR_d
source: Information Provider Reference A name, registered with the IPTC/NAA, identifying the provider that guarantees the uniqueness of the UNO
cs: Reference poskytovatele informací - název jak je registrován IPTC/NAA identifikující poskytovatele zaručujícího unikátnost UNO

# IPR_d2
source: Information Provider Reference
cs: Reference poskytovatele informací

# UCD_d
source: UNO Creation Date Specifies a 24 hour period in which the further elements of the UNO have to be unique.
cs: Datum vytvoření UNO určuje 24 hodinovou periodu, v rámci níž musí být další elementy UNO unkátní.

# ODE_d
source: Object Descriptor Element In conjunction with the UCD and the IPR, a string of characters ensuring the uniqueness of the UNO.
cs: Element popisovače objektu spolu s UCD a IPR - řetězec znaků zajišťující unikátnost UNO.

# OVI_d
source: Object Variant Indicator A string of characters indicating technical variants of the object such as partial objects, or changes of file formats, and coded character sets.
cs: Indikátor varianty obkjektu - řetězec znaků značící technickou variantu objektu (jako částečné objekty, změny formátu souborů a kódovací znakovou sadu).

# Type_d
source: Type of components
cs: Typ komponent

# Components_d
source: Number of components
cs: Počet komponent

source: String value of the property {0} must be {1} bytes long.
cs: Řetězcová hosnota vlastnosti {0} musí být {1} bytů dlouhá.

source: String value of the property {0} can be maximally {1} bytes long.
cs: Řetězcová hodnota vlastnosti {0} může být maximálně {1} bytů dlouhá.
