Repository: DzonnyDZ/Tools
Catalog: Tools.Text.Unicode/Text/Unicode/UnicodeResources.*.resx
Languages: cs

# propcat_General
source: General
cs: Obecné

# propcat_Case
source: Case
cs: Velikost

# propcat_Normalization
source: Normalization
cs: Normalizace

# propcat_ShapingAndRendering
source: Shaping and Rendering
cs: Tvary a vykreslování

# propcat_Bidirectional
source: Bidirectional
cs: Obousměrnost

# propcat_Identifiers
source: Identifiers
cs: Identifikátory

# propcat_Miscellaneous
source: Miscellaneous
cs: Různé

# propcat_Contributory
source: Contributory
cs: Dílčí

# propcat_Numeric
source: Numeric
cs: Číselné

# propstat_Normative
source: Normative
cs: Normativní

# propstat_Informative
source: Informative
cs: Informativní

# propstat_Contributory
source: Contributory
cs: Dílčí

# propstat_Provisional
source: Provisional
cs: Provizorní

# proptype_Catalog
source: Catalog
cs: Katalog

# proptype_Enumeration
source: Enumeration
cs: Výčet

# proptype_Binary
source: Binary
cs: Binární

# proptype_String
source: String
cs: Řetězec

# proptype_Numeric
source: Numeric
cs: Číslo

# proptype_Miscellaneous
source: Miscellaneous
cs: Různé

# propcat_unihan_IrgSources
source: IRG Sources
cs: IRG zdroje

# propcat_unihan_OtherMappings
source: Other Mappings
cs: Ostatní mapování

# propcat_unihan_DictionaryIndices
source: Dictionary Indices
cs: Odkazy do slovníků

# propcat_unihan_Readings
source: Readings
cs: Čtení

# propcat_unihan_DictionaryLikeData
source: Dictionary-like Data
cs: Slovníková data

# propcat_unihan_RadicalStrokeCount
source: Radical Stroke Count
cs: Počet tahů

# propcat_unihan_Variants
source: Variants
cs: Varianty

# propcat_unihan_NumericValues
source: Numeric Values
cs: Číslené hodnoty

# ex_CodepointMustStartWithUPlus
source: Codepoint must start with U+
cs: COdepoint musí začínat na U+

# propcat_unihan_Unknown
source: unknown
cs: naznámé

# ex_InvalidXmlElement
source: Element must be {0}
cs: Element musí být {0}

# ex_UnrecognizedFormatCharacter
source: Unrecognized format character {0}
cs: Nerozpoznaný formátovací znak {0}

# ex_CannotFindCodePoint
source: Cannot find code point represented by {0}. {1} instance was either initialized without XML document or information is not available for current code point.
cs: Nebylo možno nalézt codepoint reprezentovaný {0}. Instance {1} byla buďto inicializována bez XML dokumentu nebo informace pro tento codepoint není dostupná.

# ex_MakeSingleFromSingle
source: Only range characters can be used to make single characters.
cs: Jen znaky představující rozsahy mohou být použitý k vytvoření jednotlivých znaků.

# ex_NotAllowedForPlaceholderCharacters
source: Not allowed for placeholder characters.
cs: Není povoleno pro zástupné znaky.

# ex_OperationIsNotValidForCharacterRanges
source: Operation is not valid for character ranges.
cs: Operace naní platná pro rozsahy znaků.

# ex_RangeNotFullySpecified
source: This range is not fully specified. Either first or last codepoint is not specified.
cs: Tento rozsah není plně specifikován. Buďto počáteční nebo koncový codepoint chybí.

# ex_SequenceContainsPlaceholder
source: Sequence contains placeholder
cs: Sekvence obsahuje zástupný znak.

# ex_SurrogatePair
source: Character represents surrogate pair
cs: Znak reprezentuje pár náhrad.

# ex_UnsupportedBidirectionalCategory
source: Unsupported bidirectional category {0}
cs: Nepodporovaná bidi kategorie {0}

# ex_UnsuppportedGeneralCategory
source: Unsuppported general category {0}
cs: Nepodporovaná obecná kategorie {0}

# ex_ValueCannotBeParsed
source: Value {0} cannot be parsed as {1}
cs: Hodnota {0} nemůže být naparzována jako {1}

# d_CSUR_Type
source: Type
cs: Typ

# d_CSUR_BidiCategory
source: Bidi Category
cs: Bidi kategorie

# d_CSUR_Name
source: Name
cs: Název

# d_CSUR_LastRevision
source: Last revision
cs: Poslední revize

# d_CSUR_ReservedFor
source: Reserved for
cs: Rezervováno pro

# d_CSUR_Script
source: Script
cs: Skript

# propcat_other_Infrastructure
source: Infrastructure
cs: Pomocné

# d_other_Type
source: Type
cs: Typ

# d_other_FirstCodePoint
source: First Code-point
cs: První znak

# d_other_LastCodePoint
source: Last Code-point
cs: Poslední znak

# d_CSUR_Creator
source: Creator
cs: Autor

# ex_ErrorReadingNameAliases
source: Erorr while reading name aliases on line {0}: {1}
cs: Chyba při čtení aliasů jmen na řádku {0}: {1}

# ex_NameAlias_NotHex
source: Unexpected character. Expected uppercase hexadecimal digit
cs: Neučekávaný znak. Očekáváno hexačíslo velkými písmeny.

# ex_NamesListAlreadyLoaded
source: NamesList extension is already loaded
cs: Rozšíření NamesLis jej již načteno

# ex_CollectionCopyToSmallArray
source: Not enough space in destination array
cs: V cílovém poli není dost místa

# ex_FirstLastCharSwapped
source: First character cannot be greater than last charatcer
cs: První znak nemůže být větší než poslední znak

# ex_NoCharsInCollection
source: No characters in collection
cs: V kolekci se nenacházejí žádné znaky

# ex_MultidimensionalArray
source: Array is multidimensional
cs: Pole je vícerozměrné

# ex_EnumeratorState
source: Enumeration has not yet started or it has already finished.
cs: Procházení buďto ještě nezačalo nebo již skončilo.

# d_other_NameAliases
source: Normative name aliases
cs: Normativní aliasy jmen

# d_other_LocalizedName
source: Localized name
cs: Localizovaný název

# d_other_GeneralCategoryClass
source: General category class
cs: Třída obecné kategorie

# d_other_BidiStrength
source: Bidi Strength
cs: Bidi síla

# d_UniversalName
source: Friendly name
cs: Čitelný název

# d_Age
source: Age
cs: Věk

# d_Name
source: Name
cs: Název

# d_Name1
source: Unicode 1 Name
cs: Název Unicode 1

# d_GeneralCategory
source: General Category
cs: Obecná ktegorie

# d_CanonicalCombiningClass
source: Canonical Combining Class
cs: Kanonická kombinační třída

# d_BidiClass
source: Bidi Class
cs: Bidi kategorie

# d_BidiMirrored
source: Bidi Mirrored
cs: Bidi zrdcadlově

# d_BidiMirroringGlyph
source: Bidi Mirroring Glyph
cs: Bidi zrdcadlový glyph

# d_IsBidiControl
source: Bidi Control
cs: Bidi kontrolní

# d_DecompositionType
source: Decomposition type
cs: Dekompoziční typ

# d_DecompositionMapping
source: Decomposition Mapping
cs: Dekompoziční mapování

# d_CompositionExclusion
source: Composition Exclusion
cs: Výjimka z kompozice

# d_FullCompositionExclusion
source: Full Composition Exclusion
cs: Výjimka z plné kompozice

# d_NormalizationFormCQuickCheck
source: Normalization Form C Quick Check
cs: Rychlá kontrola normalizační formy C

# d_NormalizationFormDQuickCheck
source: Normalization Form D Quick Check
cs: Rychlá kontrola normalizační formy D

# d_NormalizationFormKCQuickCheck
source: Normalization Form KC Quick Check
cs: Rychlá kontrola normalizační formy KC

# d_NormalizationFormKDQuickCheck
source: Normalization Form KD Quick Check
cs: Rychlá kontrola normalizační formy KD

# d_CaseFoldingClosureMappingKC
source: Case Folding Closure Mapping KC
cs: Uzavření změny velikosti při mapování KC

# d_ExpandsOnC
source: Expands on Normalization Form C
cs: Expanduje při normalizační formě C

# d_ExpandsOnD
source: Expands on Normalization Form D
cs: Expanduje při normalizační formě D

# d_ExpandsOnKC
source: Expands on Normalization Form KC
cs: Expanduje při normalizační formě KC

# d_ExpandsOnKD
source: Expands on Normalization Form KD
cs: Expanduje při normalizační formě KD

# d_NumericType
source: Numeric Type
cs: Numerický typ

# d_NumericValue
source: Numeric Value
cs: Numerická hodnota

# d_JoiningType
source: Joining Type
cs: Typ spojování

# d_JoiningGroup
source: Joining Group
cs: Spojovací skupina

# d_JoinControl
source: Join Control
cs: Kontrol spojování

# d_LineBreak
source: Line Break
cs: Konec řádku

# d_EastAsianWidth
source: East Asian Width
cs: Východoasijská šířka

# d_IsUppercase
source: Uppercase
cs: Velké

# d_IsLowercase
source: Lowercase
cs: Malé

# d_IsOtherUppercase
source: Other Uppercase
cs: Jiné velké

# d_IsOtherLowercase
source: Other Lowercase
cs: Jiné malé

# d_SimpleUppercaseMapping
source: Simple Uppercase Mapping
cs: Jednoduché mapování na velká písmena

# d_SimpleLowercaseMapping
source: Simple Lowercase Mapping
cs: Jednoduché mapování na malá písmena

# d_SimpleTilecaseMapping
source: Simple Tilecase Mapping
cs: Jednoduché mapování na verzálky

# d_UppercaseMapping
source: Uppercase Mapping
cs: Mapování na velká písmena

# d_LowercaseMapping
source: Lowercase Mapping
cs: Mapování na malá písmena

# d_TilecaseMapping
source: Tilecase Mapping
cs: Mapování na verzálky

# d_SimpleCaseFolding
source: Simple Case Folding
cs: Jednoduchá změna velikosti

# d_CaseFolding
source: Case Folding
cs: Změna velikosti

# d_IsCaseIgnorable
source: Case Ignorable
cs: Ignoruje velikost písmen

# d_IsCased
source: Cased
cs: Rozlišuje velikost písmen

# d_ChangesWhenCasefolded
source: Changes when Casefolded
cs: Změna při změně velikosti

# d_ChangesWhenCasemapped
source: Changes when Casemapped
cs: Změna při mapování velikosti

# d_ChangesWhenLoweracsed
source: Changes when Loweracsed
cs: Změna při převodu na malá písmena

# d_ChangesWhenTilecased
source: Changes when Tilecased
cs: Změna při převodu na verzálky

# d_ChangesWhenNfKCCasefold
source: Changes when Normalization Form KC Casefold
cs: Změna při změně velikosti normalizační formy KC

# d_NfKCCasefold
source: Normalization form KC Casefold
cs: Změna velikosti normalizační formy KC

# d_Script
source: Script
cs: Skript

# d_IsoComment
source: ISO Comment
cs: ISO komentář

# d_HangulSyllableType
source: Hangul Syllable Type
cs: Typ Hangŭl slabiky

# d_JamoShortName
source: Jamo Short Name
cs: Krátké jméno Džamo

# d_IndicSyllabicCategory
source: Indic Syllabic Category
cs: Kategorie indických slabik

# d_IndicMantraCategory
source: Indic Mantra Category
cs: Kategorie indické mantry

# d_IsIdStart
source: Identifier Start
cs: Začátek identifikátoru

# d_IsOtherIdStart
source: Other Identifier Start
cs: Jiný začátek identifikátoru

# d_IsIdStartEx
source: Identifier Start alternative
cs: Alternativní začátek identifikátoru

# d_IsIdContinue
source: Identifier Continuation
cs: Pokračování identifikátoru

# d_IsOtherIdContinue
source: Other Identifier Continuation
cs: Jiné pokračování identifikátoru

# d_IsIdContinueEx
source: Identifier Continuation alternative
cs: Alternativní pokračování identifikátoru

# d_IsPatternSyntax
source: Pattern Syntax
cs: Syntaxe vzoru

# d_IsPatternWhiteSpace
source: Pattern Whitespace
cs: Bílý znka vzoru

# d_IsDash
source: Dash
cs: Pomlčka

# d_IsHyphen
source: Hyphen
cs: Spojovník

# d_IsQuotationMark
source: Quotation Mark
cs: Uvozovky

# d_IsTerminalPunctuation
source: Terminal Punctuation
cs: Koncová interpunkce

# d_IsSentenceTerminal
source: Sentence Terminal
cs: Konec věty

# d_IsDiacritic
source: Diacritic
cs: Diakritika

# d_IsExtender
source: Extender
cs: Rozšíření

# d_IsSoftDotted
source: Soft-dotted
cs: Volná tečka

# d_IsAlphabetic
source: Alphabetic
cs: Písmeno

# d_IsOtherAlphabetic
source: Other Alphabetic
cs: Jiné písmeno

# d_IsMath
source: Math
cs: Matematický

# d_IsOtherMath
source: Other Math
cs: Jiný matematický

# d_IsHexaDigit
source: Hexa-digit
cs: Hexačíslo

# d_IsAsciiHex
source: ASCII Hexa-digit
cs: ASCII hexačíslo

# d_IsDefaultIgnorable
source: Default Ignorable Code Point
cs: Obvykle ignorovaný codepoint

# d_IsOtherDefaultIgnorable
source: Other Default Ignorable Code Point
cs: Jiný obvykle ignorovaný codepoint

# d_IsLogicalOrderException
source: Logical Order Exception
cs: Výjimka z logického řazení

# d_IsWhitespace
source: Whitespace
cs: Bílý znak

# d_IsGraphemeBase
source: Grapheme Base
cs: Základ grafému

# d_IsGraphemeExtend
source: Grapheme Extend
cs: Rozšíření grafému

# d_IsOtherGraphemeExtend
source: Other Grapheme Extend
cs: Jiné rozšíření grafému

# d_IsGraphemeLink
source: Grapheme Link
cs: Propojení grafému

# d_GraphemeClusterBreak
source: Grapheme Cluster Break
cs: Přerušení skupiny grafémů

# d_WordBreak
source: Word Break
cs: Přerušení slova

# d_SentenceBreak
source: Sentence Break
cs: Přerušení věty

# d_IsIdeograph
source: Ideographic
cs: Ideograf

# d_IsUnifiedIdeograph
source: Unified Ideograph
cs: Unifikovaný ideograf

# d_IsIdsBinaryOperator
source: Ideographic Description Sequence Binary Operator
cs: Binární operátor popisu sekvence ideografů

# d_IsIdsTrinaryOperator
source: Ideographic Description Sequence Trinary Operator
cs: Ternární operátor popisu sekvence ideografů

# d_IsRadical
source: CJK Radical
cs: CJK základ

# d_IsDeprecated
source: Deprecated
cs: Zavrženo

# d_IsVariationSelector
source: Variation Selector
cs: Výběr varianty

# d_IsNonCharacter
source: Non-character Code Point
cs: Není znak

# d_unihan_HanAccountingNumeric
source: Unihan Accounting Numeric
cs: Unihan účetnicé číslo

# d_unihan_HanBig5
source: Unihan Big 5 Mapping
cs: Unihan mapování Big 5

# d_unihan_HanCangjie
source: Unihan Cangjie code
cs: Unihan Cchang-džie kód

# d_unihan_HanCantonese
source: Unihan Cantonese Pronounciation
cs: Unihan kantonská výslovnost

# d_unihan_HanCccii
source: Unihan CCCII Mapping
cs: Unihan CCCII mapování

# d_unihan_HanCheungBauer
source: Unihan Cheung-Bauer Reading
cs: Unihan výslovnost podle Čang-Bauer

# d_unihan_HanCheungBauerIndex
source: Unihan Cheung-Bauer Index
cs: Unihan odkaz do Čang-Bauer

# d_unihan_HanCihai
source: Unihan Cihai
cs: Unihan C-hai

# d_unihan_HanCns1986
source: Unihan CNS 11643-1986 Mapping
cs: Uniham mapování CNS 11643-1986

# d_unihan_HanCns1992
source: Unihan CNS 11643-1992 Mapping
cs: Unihan mapování CNS 11643-1992

# d_unihan_HanCompatibilityVariant
source: Unihan Compatibility Variant
cs: Unihan kompatibilní varianta

# d_unihan_HanDefinition
source: Unihan Definition
cs: Unihan definice

# d_unihan_HanFennIndex
source: Unihan Fenn Index
cs: Unihan odkaz do Fenn

# d_unihan_HanFourCornerCode
source: Unihan Four-corner Code
cs: Unihan čtyřrohový kód

# d_unihan_HanFrequency
source: Unihan Frequency
cs: Unihan četnost

# d_unihan_HanGradeLevel
source: Unihan Grade Level
cs: Unihan ročník

# d_unihan_HanHangul
source: Unihan Readings
cs: Unihan výslovnost

# d_unihan_HanHanYu
source: Unihan Hanyu Da Zidian
cs: Unihan Chan-jou

# d_unihan_HanHanyuPinlu
source: Unihan Xindai Hanyu Pinlu Cidian
cs: Unihan Šin-dai Han-ju Pin-lu Zidi-jan

# d_unihan_HanHanyuPinyin
source: Unihan Hànyǔ Dà Zìdiǎn
cs: Unihan Chan-jou Dac Zidi-jan

# d_unihan_HanHDZRadBreak
source: Unihan Hanyu Da Zidian Break
cs: Unihan Chan-jou Dac Zidi-jan přerušení

# d_unihan_HanHKGlyph
source: Unihan Hong Kong Glyph
cs: Unihan hongkongský glyph

# d_unihan_HanHkscs
source: Unihan Hong Kong Supplementary Character Set
cs: Unihan doplňková hongkongská znaková sada

# d_unihan_HanIbmJapan
source: Unihan IBM Japan
cs: Unihan IBM Japonsko

# d_unihan_HanIrgHanyuDaZidian
source: Unihan Hanyu Da Zidian (IRG)
cs: Unihan Chan-jou Da Zidi-jan (IRG)

# d_unihan_HanIrgKangXi
source: Unihan Kang Xi (IRG)
cs: Unihan Kang Ši (IRG)

# d_unihan_HanAlternateHanYu
source: Unihan Alternate Han Yu
cs: Unihan alternativní Han Ju

# d_unihan_HanIrgGSource
source: Unihan IRG “G” Source
cs: Unihan IRG “G” zdroj

# d_unihan_HanIrgHSource
source: Unihan IRG “H” Source
cs: Unihan IRG “H” zdroj

# d_unihan_HanIrgJSource
source: Unihan IRG “J” Source
cs: Unihan IRG “J” zdroj

# d_unihan_HanIrgKPSource
source: Unihan IRG “KP” Source
cs: Unihan IRG “KP” zdroj

# d_unihan_HanIrgKSource
source: Unihan IRG “K” Source
cs: Unihan IRG “K” zdroj

# d_unihan_HanIrgMSource
source: Unihan IRG “M” Source
cs: Unihan IRG “M” zdroj

# d_unihan_HanIrgTSource
source: Unihan IRG “T” Source
cs: Unihan IRG “T” zdroj

# d_unihan_HanIrgUSource
source: Unihan IRG “U” Source
cs: Unihan IRG “U” zdroj

# d_unihan_HanIrgVSource
source: Unihan IRG “V” Source
cs: Unihan IRG “V” zdroj

# d_unihan_HanAlternateJef
source: Unihan Alternate JEF
cs: Unihan alternativní JEF

# d_unihan_HanAlternateKangXi
source: Unihan Alternate Kang Xi
cs: Unihan alternativní Kang Ši

# d_unihan_HanAlternateMorohashi
source: Unihan Alternate Morohashi
cs: Unihan alternativní Morohaši

# d_unihan_HanJapaneseKun
source: Unihan Japanese Kun
cs: Unihan japonský kun

# d_unihan_HanJapaneseOn
source: Unihan Japanese On
cs: Unihan japonský on

# d_unihan_HanKangXi
source: Unihan Kang Xi
cs: Unihan Kang Ši

# d_unihan_HanKorean
source: Unihan Korean
cs: Unihan korejský

# d_unihan_HanMainlandTelegraph
source: Unihan Chinese Telegraph
cs: Unihan čínský telegraf

# d_unihan_HanMandarin
source: Unihan Mandarin
cs: Unihan mandarinský

# d_unihan_HanMorohashi
source: Unihan Morohashi
cs: Unihan Morohaši

# d_unihan_HanOtherNumeric
source: Unihan Other Numeric
cs: Unihan jiná čísla

# d_unihan_HanPhonetic
source: Unihan Phonetic
cs: Unihan foneticky

# d_unihan_HanPrimaryNumeric
source: Unihan Primary Numeric
cs: Unihan primární čísla

# d_unihan_HanRSAdobeJapan
source: Unihan Adobe-Japan1-6
cs: Unihan Adobe-Japonsko 1-6

# d_unihan_HanRSJapanese
source: Unihan Radical/stroke Count (Japanese)
cs: Unihan základ/počet tahů (Japonsko)

# d_unihan_HanRSKangXi
source: Unihan Radical/stroke Count (Kang Xi)
cs: Unihan základ/počet tahů (Kang Ši)

# d_unihan_HanRSKanWa
source: Unihan Radical/stroke Count (Morohashi)
cs: Unihan základ/počet tahů (Morohaši)

# d_unihan_HanRSKorean
source: Unihan Radical/stroke Count (Korean)
cs: Unihan základ/počet tahů (Korea)

# d_unihan_HanRSUnicode
source: Unihan Radical/stroke Count (Unicode)
cs: Unihan základ/počet tahů (Unicode)

# d_unihan_HanSongBenGuangYun
source: Unihan Song Ben Guang Yun
cs: Unihan Song Ben Kuang Jun

# d_unihan_HanSemanticVariant
source: Unihan Semantic Variant
cs: Unihan sémantická varianta

# d_unihan_HanSimplifiedVariant
source: Unihan Simplified Variant
cs: Unihan zjednodušená varianta

# d_unihan_HanSpecializedSemanticVariant
source: Unihan Specialized Semantic Variant
cs: Unihan specializovaná sémantická varianta

# d_unihan_HanTaiwanTelegraph
source: Unihan Taiwan Telegraph
cs: Unihan taiwanský telegraf

# d_unihan_HanTotalStrokes
source: Unihan Total Strokes
cs: Unihan celkový počet tahů

# d_unihan_HanTraditionalVariant
source: Unihan Traditional Variant
cs: Unihan tradiční varianta

# d_unihan_HanVietnamese
source: Unihan Vietnamese
cs: Unihan vietnamsky

# d_unihan_HanXiàndàiHànyǔCídiǎn
source: Unihan Xiàndài Hànyǔ Cídiǎn
cs: Unihan Šin-dai Han-ju Zidi-jan

# d_unihan_HanZVariant
source: Unihan Z-variant
cs: Unihan Z-varianta

# d_unihan_HanRSMerged
source: Unihan Radical/stroke Count (Merged)
cs: Unihan základ/počet tahů (sjednocený)

# d_unihan_HanWubi
source: Unihan Wubi
cs: Unihan Vu-bi

# d_Block
source: Block
cs: Blok

# d_ScriptExtensions
source: Script extensions
cs: Rozšíření skriptů

# d_BidiPairedBracket
source: Bidi paired bracket
cs: Bidi párovaní závorek

# d_BidiPairedBracketType
source: Bidi paired bracket type
cs: Bidi typ párovaných závorek
