Repository: DzonnyDZ/Tools
Catalog: Tools.TotalCommander/TotalCommander Plugin Builder/My Project/Resources.*.resx
Languages: cs

# e_LoadAssembly
source: Error while loading assembly: {0}.
cs: Chyba při načítání sestavení: {0}.

# e_LoadType
source: Cannot load type {0}: {1}
cs: Namohu načíst typ {0}: {1}

# e_Generating
source: Error while generating plugins: {0}
cs: Chyba při generování pluginů: {0}

# e_DuplicitRenameName
source: Duplicit name {0} scpecified for renaming.
cs: Duplicitní název {0} specifikovaný pro přejmenování.

# e_DuplicitRenameType
source: Duplicit type {0} specified for renaming.
cs: Duplicitní typ {0} specifikovaný pro přejmenování.

# XcannotbeYwhenZisW
source: {0} cannot be {1} when {2} is {3}.
cs: {0} nemůže být {1}, když {2} je {3}

# e_NotAPluginType
source: Cannot gerenrate plugin for type {0}, which does not derive from supported plugin type.
cs: Nemohu vygenerovat plugin pro typ {0}, který nedědí od podporovaného typu pluginů.

# e_OpenGeneric
source: Cannot generate plugin for open generic type {0}.
cs: Nemohu vegenerovat plugin pro otevřený generický typ {0}.

# e_Abstract
source: Cannot generate plugin for abstract type {0}.
cs: Nemohu vygenerovat plugin pro abstraktní typ {0}.

# e_NoDefaultCTor
source: Cannot generate plugin for type {0} which has not default constructor.
cs: Nemohu vygenerovat plugin pro typ {0}, který nemů výchozí konstruktor.

# e_NotPublic
source: Cannot generate plugin for non-public type {0}.
cs: Nemohu vygenerovat plugin pro neveřejný typ {0}.

# i_CreatingPluginForType
source: Creating plugin for type {0}.
cs: Vytvářím plugin pro typ {0}.

# i_TempIntermediateDir
source: Creating temporary intermediate directory {0}
cs: Vytvářím dočasnou přechodnou složku {0}

# i_PredefinedIntermediateDir
source: Using predefined intermediate directory {0}.
cs: Používám předdefinovanou přechodnou složku {0}.

# e_CleanIntermediate
source: Error while clening intermediate directory.
cs: Chzyba při čištění přechodné složky.

# i_CeateUserDefinedIntermediateDir
source: Creating user-defined intermediate directory {0}
cs: Vytvářím uživatelem definovanou přechodnou složku {0}

# i_CopyTemplate
source: Copy template from {0}
cs: Kopíruji šablonu z {0}

# i_ExtractTemplate
source: Extract built-in template
cs: Extrahuje vestavěnou šablonu

# i_CopyAssembly
source: Copy assembly file {0}
cs: Kopíruji soubor sestavení {0}

# i_PluginType_wfx
source: Plugin type: File System Plugin (wfx)
cs: Typ pluginu: Plugin souborového systému (wfx)

# i_GeneratingAssemblyInfo
source: Generating assembly info
cs: Vytvářím informace o sestavení

# i_InvokingCompiler
source: Invoking compiler {0}
cs: Spouštím kompilátor

# i_CopyOutput
source: Copying output from {0} to {1}
cs: Kopírují výstup z {0} do {1}

# i_CopyPDB
source: Copying pdb file from {0} to {1}
cs: Kopíruji pdb soubor z {0} do {1}

# i_RemoveIntermediate
source: Removing intermediate directory {0}
cs: Odstraňuji přechodnou složku {0}

# e_RemoveIntermediate
source: Error while removing intermediate directory {0}
cs: Chyba při odstraňování přechodné složky {0}

# e_MissingPluginMethod
source: Type {0} does not implement method {1} required by {2} applied onto method {3}.
cs: Typ {0} neimplementuje metodu {1} požadovanou {2} aplikovaným na metodu {3}.

# i_Executing
source: Executing {0} {1}
cs: Spouštím {0} {1}

# i_ExitCode
source: {0}> Exict code {1}.
cs: {0}> návratový kód {1}.

# w_DelDir
source: Warning: Cannot delete directory {0}: {1}
cs: Varování: Nemoho odstranit složku {0}: {1}

# e_ExitCode
source: Process {0} exited with code {1}.
cs: Process {0} skončil s kódem {1}.

source: Environmental variables:
cs: Proměnné prostředí:
